package net.jeeshop.core.util;

import java.util.HashMap;
import java.util.Map;

import net.jeeshop.services.manage.area.bean.Area;

public class CreateAreaUtil {
	public static void main(String[] args) {
//		List<Province> pro = new LinkedList<Province>();
//		Province beijing = new Province();
//		beijing.code = "110000";
//		beijing.name = "北京";
////		beijing.citys.add()
//		pro.add(beijing);

	}

	public static Map<String, Area> getAreaMap() {
		Map<String, Area> map = new HashMap<String, Area>();
		
		/**
		 * 北京
		 */
		map.put("110000",new Area("110000","北京","0"));//省份
			map.put("110100",new Area("110100","北京市","110000"));//市
				map.put("110101",new Area("110101","东城区","110100"));//区域
				map.put("110102",new Area("110102","西城区","110100"));//区域
				map.put("110103",new Area("110103","崇文区","110100"));//区域
				map.put("110104",new Area("110104","宣武区","110100"));//区域
				map.put("110105",new Area("110105","朝阳区","110100"));//区域
				map.put("110106",new Area("110106","丰台区","110100"));//区域
				map.put("110107",new Area("110107","石景山区","110100"));//区域
				map.put("110108",new Area("110108","海淀区","110100"));//区域
				map.put("110109",new Area("110109","门头沟区","110100"));//区域
				map.put("110111",new Area("110111","房山区","110100"));//区域
				map.put("110112",new Area("110112","通州区","110100"));//区域
				map.put("110113",new Area("110113","顺义区","110100"));//区域
				map.put("110114",new Area("110114","昌平区","110100"));//区域
				map.put("110115",new Area("110115","大兴区","110100"));//区域
				map.put("110116",new Area("110116","怀柔区","110100"));//区域
				map.put("110117",new Area("110117","平谷区","110100"));//区域
				map.put("110128",new Area("110128","密云县","110100"));//区域
				map.put("110129",new Area("110129","延庆县","110100"));//区域
		
		/**
		 * 天津
		 */
		map.put("120000",new Area("120000","天津","0"));
			map.put("120100",new Area("120100","天津市","120000"));
				map.put("120101",new Area("120101","和平区","120100"));
				map.put("120102",new Area("120102","河东区","120100"));
				map.put("120103",new Area("120103","河西区","120100"));
				map.put("120104",new Area("120104","南开区","120100"));
				map.put("120105",new Area("120105","河北区","120100"));
				map.put("120106",new Area("120106","红桥区","120100"));
				map.put("120107",new Area("120107","塘沽区","120100"));
				map.put("120108",new Area("120108","汉沽区","120100"));
				map.put("120109",new Area("120109","大港区","120100"));
				map.put("120110",new Area("120110","东丽区","120100"));
				map.put("120111",new Area("120111","西青区","120100"));
				map.put("120112",new Area("120112","津南区","120100"));
				map.put("120113",new Area("120113","北辰区","120100"));
				map.put("120114",new Area("120114","武清区","120100"));
				map.put("120115",new Area("120115","宝坻区","120100"));
				map.put("120116",new Area("120116","滨海新区","120100"));
				map.put("120121",new Area("120121","宁河县","120100"));
				map.put("120123",new Area("120123","静海县","120100"));
				map.put("120125",new Area("120125","蓟县","120100"));
		
		/*
		 * 河北省
		 */
		map.put("130000",new Area("130000","河北省","0"));
			map.put("130100",new Area("130100","石家庄市","130000"));
				map.put("130102",new Area("130102","长安区","130100"));
				map.put("130103",new Area("130103","桥东区","130100"));
				map.put("130104",new Area("130104","桥西区","130100"));
				map.put("130105",new Area("130105","新华区","130100"));
				map.put("130107",new Area("130107","井陉矿区","130100"));
				map.put("130108",new Area("130108","裕华区","130100"));
				map.put("130121",new Area("130121","井陉县","130100"));
				map.put("130123",new Area("130123","正定县","130100"));
				map.put("130124",new Area("130124","栾城县","130100"));
				map.put("130125",new Area("130125","行唐县","130100"));
				map.put("130126",new Area("130126","灵寿县","130100"));
				map.put("130127",new Area("130127","高邑县","130100"));
				map.put("130128",new Area("130128","深泽县","130100"));
				map.put("130129",new Area("130129","赞皇县","130100"));
				map.put("130130",new Area("130130","无极县","130100"));
				map.put("130131",new Area("130131","平山县","130100"));
				map.put("130132",new Area("130132","元氏县","130100"));
				map.put("130133",new Area("130133","赵县","130100"));
				map.put("130181",new Area("130121","辛集市","130100"));
				map.put("130182",new Area("130182","藁城市","130100"));
				map.put("130183",new Area("130183","晋州市","130100"));
				map.put("130184",new Area("130184","新乐市","130100"));
				map.put("130185",new Area("130185","鹿泉市","130100"));
			
			
			map.put("130200",new Area("130200","唐山市","130000"));
				map.put("130202",new Area("130202","路南区","130200"));
				map.put("130203",new Area("130203","路北区","130200"));
				map.put("130204",new Area("130204","古冶区","130200"));
				map.put("130205",new Area("130205","开平区","130200"));
				map.put("130207",new Area("130207","丰南区","130200"));
				map.put("130208",new Area("130208","丰润区","130200"));
				map.put("130223",new Area("130223","滦县","130200"));
				map.put("130224",new Area("130224","滦南县","130200"));
				map.put("130225",new Area("130225","乐亭县","130200"));
				map.put("130227",new Area("130227","迁西县","130200"));
				map.put("130229",new Area("130229","玉田县","130200"));
				map.put("130230",new Area("130230","唐海县","130200"));
				map.put("130281",new Area("130281","遵化市","130200"));
				map.put("130283",new Area("130283","迁安市","130200"));
				
			map.put("130300",new Area("130300","秦皇岛市","130000"));
				map.put("130302",new Area("130302","海港区","130300"));
				map.put("130303",new Area("130303","山海关区","130300"));
				map.put("130304",new Area("130304","北戴河区","130300"));
				map.put("130321",new Area("130321","青龙满族自治县","130300"));
				map.put("130322",new Area("130322","昌黎县","130300"));
				map.put("130323",new Area("130323","抚宁县","130300"));
				map.put("130324",new Area("130324","卢龙县","130300"));
				map.put("130399",new Area("130399","经济技术开发区","130300"));
			
			
			map.put("130400",new Area("130400","邯郸市","130000"));
				map.put("130402",new Area("130402","邯山区","130400"));
				map.put("130403",new Area("130403","丛台区","130400"));
				map.put("130404",new Area("130404","复兴区","130400"));
				map.put("130406",new Area("130406","峰峰矿区","130400"));
				map.put("130421",new Area("130421","邯郸县","130400"));
				map.put("130423",new Area("130423","临漳县","130400"));
				map.put("130424",new Area("130424","成安县","130400"));
				map.put("130425",new Area("130425","大名县","130400"));
				map.put("130426",new Area("130426","涉县","130400"));
				map.put("130427",new Area("130427","磁县","130400"));
				map.put("130428",new Area("130428","肥乡县","130400"));
				map.put("130429",new Area("130429","永年县","130400"));
				map.put("130430",new Area("130430","邱县","130400"));
				map.put("130431",new Area("130431","鸡泽县","130400"));
				map.put("130432",new Area("130432","广平县","130400"));
				map.put("130433",new Area("130433","馆陶县","130400"));
				map.put("130434",new Area("130434","魏县","130400"));
				map.put("130435",new Area("130435","曲周县","130400"));
				map.put("130481",new Area("130481","武安市","130400"));
			
			map.put("130500",new Area("130500","邢台市","130000"));
				map.put("130502",new Area("130502","桥东区","130500"));
				map.put("130503",new Area("130503","桥西区","130500"));
				map.put("130521",new Area("130521","邢台县","130500"));
				map.put("130522",new Area("130522","临城县","130500"));
				map.put("130523",new Area("130523","内丘县","130500"));
				map.put("130524",new Area("130524","柏乡县","130500"));
				map.put("130525",new Area("130525","隆尧县","130500"));
				map.put("130526",new Area("130526","任县","130500"));
				map.put("130527",new Area("130527","南和县","130500"));
				map.put("130528",new Area("130528","宁晋县","130500"));
				map.put("130529",new Area("130529","巨鹿县","130500"));
				map.put("130530",new Area("130530","新河县","130500"));
				map.put("130531",new Area("130531","广宗县","130500"));
				map.put("130532",new Area("130532","平乡县","130500"));
				map.put("130533",new Area("130533","威县","130500"));
				map.put("130534",new Area("130534","清河县","130500"));
				map.put("130535",new Area("130535","临西县","130500"));
				map.put("130581",new Area("130581","南宫市","130500"));
				map.put("130582",new Area("130582","沙河市","130500"));
				
				
			map.put("130600",new Area("130600","保定市","130000"));
				map.put("130602",new Area("130602","新市区","130600"));
				map.put("130603",new Area("130603","北市区","130600"));
				map.put("130604",new Area("130604","南市区","130600"));
				map.put("130621",new Area("130621","满城县","130600"));
				map.put("130622",new Area("130622","清苑县","130600"));
				map.put("130623",new Area("130623","涞水县","130600"));
				map.put("130624",new Area("130624","阜平县","130600"));
				map.put("130625",new Area("130625","徐水县","130600"));
				map.put("130626",new Area("130626","定兴县","130600"));
				map.put("130627",new Area("130627","唐县","130600"));
				map.put("130628",new Area("130628","高阳县","130600"));
				map.put("130629",new Area("130629","容城县","130600"));
				map.put("130630",new Area("130630","涞源县","130600"));
				map.put("130631",new Area("130631","望都县","130600"));
				map.put("130632",new Area("130632","安新县","130600"));
				map.put("130633",new Area("130633","易县","130600"));
				map.put("130634",new Area("130634","曲阳县","130600"));
				map.put("130635",new Area("130635","蠡县","130600"));
				map.put("130636",new Area("130636","顺平县","130600"));
				map.put("130637",new Area("130637","博野县","130600"));
				map.put("130638",new Area("130638","雄县","130600"));
				map.put("130681",new Area("130681","涿州市","130600"));
				map.put("130682",new Area("130682","定州市","130600"));
				map.put("130683",new Area("130683","安国市","130600"));
				map.put("130684",new Area("130684","高碑店市","130600"));
				map.put("130698",new Area("130698","高开区","130600"));
				
				
			map.put("130700",new Area("130700","张家口市","130000"));
				map.put("130702",new Area("130702","桥东区","130700"));
				map.put("130703",new Area("130703","桥西区","130700"));
				map.put("130705",new Area("130705","宣化区","130700"));
				map.put("130706",new Area("130706","下花园区","130700"));
				map.put("130721",new Area("130721","宣化县","130700"));
				map.put("130722",new Area("130722","张北县","130700"));
				map.put("130723",new Area("130723","康保县","130700"));
				map.put("130724",new Area("130724","沽源县","130700"));
				map.put("130725",new Area("130725","尚义县","130700"));
				map.put("130726",new Area("130726","蔚县","130700"));
				map.put("130727",new Area("130727","阳原县","130700"));
				map.put("130728",new Area("130728","怀安县","130700"));
				map.put("130729",new Area("130729","万全县","130700"));
				map.put("130730",new Area("130730","怀来县","130700"));
				map.put("130731",new Area("130731","涿鹿县","130700"));
				map.put("130732",new Area("130732","赤城县","130700"));
				map.put("130733",new Area("130733","崇礼县","130700"));
			
			
			map.put("130800",new Area("130800","承德市","130000"));
				map.put("130802",new Area("130802","双桥区","130800"));
				map.put("130803",new Area("130803","双滦区","130800"));
				map.put("130804",new Area("130804","鹰手营子矿区","130800"));
				map.put("130821",new Area("130821","承德县","130800"));
				map.put("130822",new Area("130822","兴隆县","130800"));
				map.put("130823",new Area("130823","平泉县","130800"));
				map.put("130824",new Area("130824","滦平县","130800"));
				map.put("130825",new Area("130825","隆化县","130800"));
				map.put("130826",new Area("130826","丰宁满族自治县","130800"));
				map.put("130827",new Area("130827","宽城满族自治县","130800"));
				map.put("130828",new Area("130828","围场满族蒙古族自治县","130800"));
				
				
			map.put("130900",new Area("130900","沧州市","130000"));
				map.put("130902",new Area("130902","新华区","130900"));
				map.put("130903",new Area("130903","运河区","130900"));
				map.put("130921",new Area("130921","沧县","130900"));
				map.put("130922",new Area("130922","青县","130900"));
				map.put("130923",new Area("130923","东光县","130900"));
				map.put("130924",new Area("130924","海兴县","130900"));
				map.put("130925",new Area("130925","盐山县","130900"));
				map.put("130926",new Area("130926","肃宁县","130900"));
				map.put("130927",new Area("130927","南皮县","130900"));
				map.put("130928",new Area("130928","吴桥县","130900"));
				map.put("130929",new Area("130929","献县","130900"));
				map.put("130930",new Area("130930","孟村回族自治县","130900"));
				map.put("130981",new Area("130981","泊头市","130900"));
				map.put("130982",new Area("130982","任丘市","130900"));
				map.put("130983",new Area("130983","黄骅市","130900"));
				map.put("130984",new Area("130984","河间市","130900"));
			
			
			map.put("131000",new Area("131000","廊坊市","130000"));
				map.put("131002",new Area("131002","安次区","131000"));
				map.put("131003",new Area("131003","广阳区","131000"));
				map.put("131022",new Area("131022","固安县","131000"));
				map.put("131023",new Area("131023","永清县","131000"));
				map.put("131024",new Area("131024","香河县","131000"));
				map.put("131025",new Area("131025","大城县","131000"));
				map.put("131026",new Area("131026","文安县","131000"));
				map.put("131028",new Area("131028","大厂回族自治县","131000"));
				map.put("131051",new Area("131051","开发区","131000"));
				map.put("131052",new Area("131052","燕郊经济技术开发区","131000"));
				map.put("131081",new Area("131081","霸州市","131000"));
				map.put("131082",new Area("131082","三河市","131000"));
			
			
			map.put("131100",new Area("131100","衡水市","130000"));
				map.put("131102",new Area("131102","桃城区","131100"));
				map.put("131121",new Area("131121","枣强县","131100"));
				map.put("131122",new Area("131122","武邑县","131100"));
				map.put("131123",new Area("131123","武强县","131100"));
				map.put("131124",new Area("131124","饶阳县","131100"));
				map.put("131125",new Area("131125","安平县","131100"));
				map.put("131126",new Area("131126","故城县","131100"));
				map.put("131127",new Area("131127","景县","131100"));
				map.put("131128",new Area("131128","阜城县","131100"));
				map.put("131181",new Area("131181","冀州市","131100"));
				map.put("131182",new Area("131182","深州市","131100"));
		
		/*
		 * 山西省
		 */
		map.put("140000",new Area("140000","山西省","0"));
			map.put("140100",new Area("140100","太原市","140000"));
				map.put("140105",new Area("140105","小店区","140100"));
				map.put("140106",new Area("140106","迎泽区","140100"));
				map.put("140107",new Area("140107","杏花岭区","140100"));
				map.put("140108",new Area("140108","尖草坪区","140100"));
				map.put("140109",new Area("140109","万柏林区","140100"));
				map.put("140110",new Area("140110","晋源区","140100"));
				map.put("140121",new Area("140121","清徐县","140100"));
				map.put("140122",new Area("140122","阳曲县","140100"));
				map.put("140123",new Area("140123","娄烦县","140100"));
				map.put("140181",new Area("140181","古交市","140100"));
		
		
			map.put("140200",new Area("140200","大同市","140000"));
				map.put("140202",new Area("140202","城区","140200"));
				map.put("140203",new Area("140203","矿区","140200"));
				map.put("140211",new Area("140211","南郊区","140200"));
				map.put("140212",new Area("140212","新荣区","140200"));
				map.put("140221",new Area("140221","阳高县","140200"));
				map.put("140222",new Area("140222","天镇县","140200"));
				map.put("140223",new Area("140223","广灵县","140200"));
				map.put("140224",new Area("140224","灵丘县","140200"));
				map.put("140225",new Area("140225","浑源县","140200"));
				map.put("140226",new Area("140226","左云县","140200"));
				map.put("140227",new Area("140227","大同县","140200"));
			
			map.put("140300",new Area("140300","阳泉市","140000"));
				map.put("140302",new Area("140302","城区","140300"));
				map.put("140303",new Area("140303","矿区","140300"));
				map.put("140311",new Area("140311","郊区","140300"));
				map.put("140321",new Area("140321","平定县","140300"));
				map.put("140322",new Area("140322","盂县","140300"));
			
			map.put("140400",new Area("140400","长治市","140000"));
				map.put("140421",new Area("140421","长治县","140400"));
				map.put("140423",new Area("140423","襄垣县","140400"));
				map.put("140424",new Area("140424","屯留县","140400"));
				map.put("140425",new Area("140425","平顺县","140400"));
				map.put("140426",new Area("140426","黎城县","140400"));
				map.put("140427",new Area("140427","壶关县","140400"));
				map.put("140428",new Area("140428","长子县","140400"));
				map.put("140429",new Area("140429","武乡县","140400"));
				map.put("140430",new Area("140430","沁县","140400"));
				map.put("140431",new Area("140431","沁源县","140400"));
				map.put("140481",new Area("140481","潞城市","140400"));
				map.put("140482",new Area("140482","城区","140400"));
				map.put("140483",new Area("140483","郊区","140400"));
				map.put("140484",new Area("140484","高新区","140400"));
				
				
			map.put("140500",new Area("140500","晋城市","140000"));
				map.put("140502",new Area("140502","城区","140500"));
				map.put("140521",new Area("140521","沁水县","140500"));
				map.put("140522",new Area("140522","阳城县","140500"));
				map.put("140524",new Area("140524","陵川县","140500"));
				map.put("140525",new Area("140525","泽州县","140500"));
				map.put("140581",new Area("140581","高平市","140500"));
			
			
			map.put("140600",new Area("140600","朔州市","140000"));
				map.put("140602",new Area("140602","朔城区","140600"));
				map.put("140603",new Area("140603","平鲁区","140600"));
				map.put("140621",new Area("140621","山阴县","140600"));
				map.put("140622",new Area("140622","应县","140600"));
				map.put("140623",new Area("140623","右玉县","140600"));
				map.put("140624",new Area("140624","怀仁县","140600"));
			
			
			map.put("140700",new Area("140700","晋中市","140000"));
				map.put("140702",new Area("140702","榆次区","140700"));
				map.put("140721",new Area("140721","榆社县","140700"));
				map.put("140722",new Area("140722","左权县","140700"));
				map.put("140723",new Area("140723","和顺县","140700"));
				map.put("140724",new Area("140724","昔阳县","140700"));
				map.put("140725",new Area("140725","寿阳县","140700"));
				map.put("140726",new Area("140726","太谷县","140700"));
				map.put("140727",new Area("140727","祁县","140700"));
				map.put("140728",new Area("140728","平遥县","140700"));
				map.put("140729",new Area("140729","灵石县","140700"));
				map.put("140781",new Area("140781","介休市","140700"));
			
			
			map.put("140800",new Area("140800","运城市","140000"));
				map.put("140802",new Area("140802","盐湖区","140800"));
				map.put("140821",new Area("140821","临猗县","140800"));
				map.put("140822",new Area("140822","万荣县","140800"));
				map.put("140823",new Area("140823","闻喜县","140800"));
				map.put("140824",new Area("140824","稷山县","140800"));
				map.put("140825",new Area("140825","新绛县","140800"));
				map.put("140826",new Area("140826","绛县","140800"));
				map.put("140827",new Area("140827","垣曲县","140800"));
				map.put("140828",new Area("140828","夏县","140800"));
				map.put("140829",new Area("140829","平陆县","140800"));
				map.put("140830",new Area("140830","芮城县","140800"));
				map.put("140881",new Area("140881","永济市","140800"));
				map.put("140882",new Area("140882","河津市","140800"));
			
			
			map.put("140900",new Area("140900","忻州市","140000"));
				map.put("140902",new Area("140902","忻府区","140900"));
				map.put("140921",new Area("140921","定襄县","140900"));
				map.put("140922",new Area("140922","五台县","140900"));
				map.put("140923",new Area("140923","代县","140900"));
				map.put("140924",new Area("140924","繁峙县","140900"));
				map.put("140925",new Area("140925","宁武县","140900"));
				map.put("140926",new Area("140926","静乐县","140900"));
				map.put("140927",new Area("140927","神池县","140900"));
				map.put("140928",new Area("140928","五寨县","140900"));
				map.put("140929",new Area("140929","岢岚县","140900"));
				map.put("140930",new Area("140930","河曲县","140900"));
				map.put("140931",new Area("140931","保德县","140900"));
				map.put("140932",new Area("140932","偏关县","140900"));
				map.put("140981",new Area("140981","原平市","140900"));
			
			
			map.put("141000",new Area("141000","临汾市","140000"));
				map.put("141002",new Area("141002","尧都区","141000"));
				map.put("141021",new Area("141021","曲沃县","141000"));
				map.put("141022",new Area("141022","翼城县","141000"));
				map.put("141023",new Area("141023","襄汾县","141000"));
				map.put("141024",new Area("141024","洪洞县","141000"));
				map.put("141025",new Area("141025","古县","141000"));
				map.put("141026",new Area("141026","安泽县","141000"));
				map.put("141027",new Area("141027","浮山县","141000"));
				map.put("141028",new Area("141028","吉县","141000"));
				map.put("141029",new Area("141029","乡宁县","141000"));
				map.put("141030",new Area("141030","大宁县","141000"));
				map.put("141031",new Area("141031","隰县","141000"));
				map.put("141032",new Area("141032","永和县","141000"));
				map.put("141033",new Area("141033","蒲县","141000"));
				map.put("141034",new Area("141034","汾西县","141000"));
				map.put("141081",new Area("141081","侯马市","141000"));
				map.put("141082",new Area("141082","霍州市","141000"));
				
			map.put("141100",new Area("141100","吕梁市","140000"));
				map.put("141102",new Area("141102","离石区","141100"));
				map.put("141121",new Area("141121","文水县","141100"));
				map.put("141122",new Area("141122","交城县","141100"));
				map.put("141123",new Area("141123","兴县","141100"));
				map.put("141124",new Area("141124","临县","141100"));
				map.put("141125",new Area("141125","柳林县","141100"));
				map.put("141126",new Area("141126","石楼县","141100"));
				map.put("141127",new Area("141127","岚县","141100"));
				map.put("141128",new Area("141128","方山县","141100"));
				map.put("141129",new Area("141129","中阳县","141100"));
				map.put("141130",new Area("141130","交口县","141100"));
				map.put("141181",new Area("141181","孝义市","141100"));
				map.put("141182",new Area("141182","汾阳市","141100"));
			
		/*
		 * 内蒙古自治区
		 */
		map.put("150000",new Area("150000","内蒙古自治区","0"));
			map.put("150100",new Area("150100","呼和浩特市","150000"));
				map.put("150102",new Area("150102","新城区","150100"));
				map.put("150103",new Area("150103","回民区","150100"));
				map.put("150104",new Area("150104","玉泉区","150100"));
				map.put("150105",new Area("150105","赛罕区","150100"));
				map.put("150121",new Area("150121","土默特左旗","150100"));
				map.put("150122",new Area("150122","托克托县","150100"));
				map.put("150123",new Area("150123","和林格尔县","150100"));
				map.put("150124",new Area("150124","清水河县","150100"));
				map.put("150125",new Area("150125","武川县","150100"));
			
			map.put("150200",new Area("150200","包头市","150000"));
				map.put("150202",new Area("150202","东河区","150200"));
				map.put("150203",new Area("150203","昆都仑区","150200"));
				map.put("150204",new Area("150204","青山区","150200"));
				map.put("150205",new Area("150205","石拐区","150200"));
				map.put("150206",new Area("150206","白云矿区","150200"));
				map.put("150207",new Area("150207","九原区","150200"));
				map.put("150221",new Area("150221","土默特右旗","150200"));
				map.put("150222",new Area("150222","固阳县","150200"));
				map.put("150223",new Area("150223","达尔罕茂明安联合旗","150200"));
			
			
			map.put("150300",new Area("150300","乌海市","150000"));
				map.put("150302",new Area("150302","海勃湾区","150300"));
				map.put("150303",new Area("150303","海南区","150300"));
				map.put("150304",new Area("150304","乌达区","150300"));
			
			map.put("150400",new Area("150400","赤峰市","150000"));
				map.put("150402",new Area("150402","红山区","150400"));
				map.put("150403",new Area("150403","元宝山区","150400"));
				map.put("150404",new Area("150404","松山区","150400"));
				map.put("150421",new Area("150421","阿鲁科尔沁旗","150400"));
				map.put("150422",new Area("150422","巴林左旗","150400"));
				map.put("150423",new Area("150423","巴林右旗","150400"));
				map.put("150424",new Area("150424","林西县","150400"));
				map.put("150425",new Area("150425","克什克腾旗","150400"));
				map.put("150426",new Area("150426","翁牛特旗","150400"));
				map.put("150428",new Area("150428","喀喇沁旗","150400"));
				map.put("150429",new Area("150429","宁城县","150400"));
				map.put("150430",new Area("150430","敖汉旗","150400"));
			
			map.put("150500",new Area("150500","通辽市","150000"));
				map.put("150502",new Area("150502","科尔沁区","150500"));
				map.put("150521",new Area("150521","科尔沁左翼中旗","150500"));
				map.put("150522",new Area("150522","科尔沁左翼后旗","150500"));
				map.put("150523",new Area("150523","开鲁县","150500"));
				map.put("150524",new Area("150524","库伦旗","150500"));
				map.put("150525",new Area("150525","奈曼旗","150500"));
				map.put("150526",new Area("150526","扎鲁特旗","150500"));
				map.put("150581",new Area("150581","霍林郭勒市","150500"));
				
			
			map.put("150600",new Area("150600","鄂尔多斯市","150000"));
				map.put("150602",new Area("150602","东胜区","150600"));
				map.put("150621",new Area("150621","达拉特旗","150600"));
				map.put("150622",new Area("150622","准格尔旗","150600"));
				map.put("150623",new Area("150623","鄂托克前旗","150600"));
				map.put("150624",new Area("150624","鄂托克旗","150600"));
				map.put("150625",new Area("150625","杭锦旗","150600"));
				map.put("150626",new Area("150626","乌审旗","150600"));
				map.put("150627",new Area("150627","伊金霍洛旗","150600"));
			
			
			map.put("150700",new Area("150700","呼伦贝尔市","150000"));
				map.put("150702",new Area("150702","海拉尔区","150700"));
				map.put("150721",new Area("150721","阿荣旗","150700"));
				map.put("150722",new Area("150722","莫力达瓦达斡尔族自治旗","150700"));
				map.put("150723",new Area("150723","鄂伦春自治旗","150700"));
				map.put("150724",new Area("150724","鄂温克族自治旗","150700"));
				map.put("150725",new Area("150725","陈巴尔虎旗","150700"));
				map.put("150726",new Area("150726","新巴尔虎左旗","150700"));
				map.put("150727",new Area("150727","新巴尔虎右旗","150700"));
				map.put("150781",new Area("150781","满洲里市","150700"));
				map.put("150782",new Area("150782","牙克石市","150700"));
				map.put("150783",new Area("150783","扎兰屯市","150700"));
				map.put("150784",new Area("150784","额尔古纳市","150700"));
				map.put("150785",new Area("150785","根河市","150700"));
			
			
			map.put("150800",new Area("150800","巴彦淖尔市","150000"));
				map.put("150802",new Area("150802","临河区","150800"));
				map.put("150821",new Area("150821","五原县","150800"));
				map.put("150822",new Area("150822","磴口县","150800"));
				map.put("150823",new Area("150823","乌拉特前旗","150800"));
				map.put("150824",new Area("150824","乌拉特中旗","150800"));
				map.put("150825",new Area("150825","乌拉特后旗","150800"));
				map.put("150826",new Area("150826","杭锦后旗","150800"));
			
			
			map.put("150900",new Area("150900","乌兰察布市","150000"));
				map.put("150902",new Area("150902","集宁区","150900"));
				map.put("150921",new Area("150921","卓资县","150900"));
				map.put("150922",new Area("150922","化德县","150900"));
				map.put("150923",new Area("150923","商都县","150900"));
				map.put("150924",new Area("150924","兴和县","150900"));
				map.put("150925",new Area("150925","凉城县","150900"));
				map.put("150926",new Area("150926","察哈尔右翼前旗","150900"));
				map.put("150927",new Area("150927","察哈尔右翼中旗","150900"));
				map.put("150928",new Area("150928","察哈尔右翼后旗","150900"));
				map.put("150929",new Area("150929","四子王旗","150900"));
				map.put("150981",new Area("150981","丰镇市","150900"));
			
			
			map.put("152200",new Area("152200","兴安盟","150000"));
				map.put("152201",new Area("152201","乌兰浩特市","152200"));
				map.put("152202",new Area("152202","阿尔山市","152200"));
				map.put("152221",new Area("152221","科尔沁右翼前旗","152200"));
				map.put("152222",new Area("152222","科尔沁右翼中旗","152200"));
				map.put("152223",new Area("152223","扎赉特旗","152200"));
				map.put("152224",new Area("152224","突泉县","152200"));
			
			
			map.put("152500",new Area("152500","锡林郭勒盟","150000"));
				map.put("152501",new Area("152501","二连浩特市","152500"));
				map.put("152502",new Area("152502","锡林浩特市","152500"));
				map.put("152522",new Area("152522","阿巴嘎旗","152500"));
				map.put("152523",new Area("152523","苏尼特左旗","152500"));
				map.put("152524",new Area("152524","苏尼特右旗","152500"));
				map.put("152525",new Area("152525","东乌珠穆沁旗","152500"));
				map.put("152526",new Area("152526","西乌珠穆沁旗","152500"));
				map.put("152527",new Area("152527","太仆寺旗","152500"));
				map.put("152528",new Area("152528","镶黄旗","152500"));
				map.put("152529",new Area("152529","正镶白旗","152500"));
				map.put("152530",new Area("152530","正蓝旗","152500"));
				map.put("152531",new Area("152531","多伦县","152500"));
			
			
			map.put("152900",new Area("152900","阿拉善盟","150000"));
				map.put("152921",new Area("152921","阿拉善左旗","152900"));
				map.put("152922",new Area("152922","阿拉善右旗","152900"));
				map.put("152923",new Area("152923","额济纳旗","152900"));
		
		/*
		 * 辽宁省
		 */
		map.put("210000",new Area("210000","辽宁省","0"));
			map.put("210100",new Area("210100","沈阳市","210000"));
				map.put("210102",new Area("210102","和平区","210100"));
				map.put("210103",new Area("210103","沈河区","210100"));
				map.put("210104",new Area("210104","大东区","210100"));
				map.put("210105",new Area("210105","皇姑区","210100"));
				map.put("210106",new Area("210106","铁西区","210100"));
				map.put("210111",new Area("210111","苏家屯区","210100"));
				map.put("210112",new Area("210112","东陵区","210100"));
				map.put("210113",new Area("210113","新城子区","210100"));
				map.put("210114",new Area("210114","于洪区","210100"));
				map.put("210122",new Area("210122","辽中县","210100"));
				map.put("210123",new Area("210123","康平县","210100"));
				map.put("210124",new Area("210124","法库县","210100"));
				map.put("210181",new Area("210181","新民市","210100"));
				map.put("210182",new Area("210182","浑南新区","210100"));
				map.put("210183",new Area("210183","张士开发区","210100"));
				map.put("210184",new Area("210184","沈北新区","210100"));
			
			map.put("210200",new Area("210200","大连市","210000"));
				map.put("210202",new Area("210202","中山区","210200"));
				map.put("210203",new Area("210203","西岗区","210200"));
				map.put("210204",new Area("210204","沙河口区","210200"));
				map.put("210211",new Area("210211","甘井子区","210200"));
				map.put("210212",new Area("210212","旅顺口区","210200"));
				map.put("210213",new Area("210213","金州区","210200"));
				map.put("210224",new Area("210224","长海县","210200"));
				map.put("210251",new Area("210251","开发区","210200"));
				map.put("210281",new Area("210281","瓦房店市","210200"));
				map.put("210282",new Area("210282","普兰店市","210200"));
				map.put("210283",new Area("210283","庄河市","210200"));
				map.put("210297",new Area("210297","岭前区","210200"));
			
			
			map.put("210300",new Area("210300","鞍山市","210000"));
				map.put("210302",new Area("210302","铁东区","210300"));
				map.put("210303",new Area("210303","铁西区","210300"));
				map.put("210304",new Area("210304","立山区","210300"));
				map.put("210311",new Area("210311","千山区","210300"));
				map.put("210321",new Area("210321","台安县","210300"));
				map.put("210323",new Area("210323","岫岩满族自治县","210300"));
				map.put("210351",new Area("210351","高新区","210300"));
				map.put("210381",new Area("210381","海城市","210300"));

				
			map.put("210400",new Area("210400","抚顺市","210000"));
				map.put("210402",new Area("210402","新抚区","210400"));
				map.put("210403",new Area("210403","东洲区","210400"));
				map.put("210404",new Area("210404","望花区","210400"));
				map.put("210411",new Area("210411","顺城区","210400"));
				map.put("210421",new Area("210421","抚顺县","210400"));
				map.put("210422",new Area("210422","新宾满族自治县","210400"));
				map.put("210423",new Area("210423","清原满族自治县","210400"));
			
			
			map.put("210500",new Area("210500","本溪市","210000"));
				map.put("210502",new Area("210502","平山区","210500"));
				map.put("210503",new Area("210503","溪湖区","210500"));
				map.put("210504",new Area("210504","明山区","210500"));
				map.put("210505",new Area("210505","南芬区","210500"));
				map.put("210521",new Area("210521","本溪满族自治县","210500"));
				map.put("210522",new Area("210522","桓仁满族自治县","210500"));
			
			
			map.put("210600",new Area("210600","丹东市","210000"));
				map.put("210602",new Area("210602","元宝区","210600"));
				map.put("210603",new Area("210603","振兴区","210600"));
				map.put("210604",new Area("210604","振安区","210600"));
				map.put("210624",new Area("210624","宽甸满族自治县","210600"));
				map.put("210681",new Area("210681","东港市","210600"));
				map.put("210682",new Area("210682","凤城市","210600"));
			
			
			map.put("210700",new Area("210700","锦州市","210000"));
				map.put("210702",new Area("210702","古塔区","210700"));
				map.put("210703",new Area("210703","凌河区","210700"));
				map.put("210711",new Area("210711","太和区","210700"));
				map.put("210726",new Area("210726","黑山县","210700"));
				map.put("210727",new Area("210727","义县","210700"));
				map.put("210781",new Area("210781","凌海市","210700"));
				map.put("210782",new Area("210782","北镇市","210700"));
			
			
			map.put("210800",new Area("210800","营口市","210000"));
				map.put("210802",new Area("210802","站前区","210800"));
				map.put("210803",new Area("210803","西市区","210800"));
				map.put("210804",new Area("210804","鲅鱼圈区","210800"));
				map.put("210811",new Area("210811","老边区","210800"));
				map.put("210881",new Area("210881","盖州市","210800"));
				map.put("210882",new Area("210882","大石桥市","210800"));
			
			
			map.put("210900",new Area("210900","阜新市","210000"));
				map.put("210902",new Area("210902","海州区","210900"));
				map.put("210903",new Area("210903","新邱区","210900"));
				map.put("210904",new Area("210904","太平区","210900"));
				map.put("210905",new Area("210905","清河门区","210900"));
				map.put("210911",new Area("210911","细河区","210900"));
				map.put("210921",new Area("210921","阜新蒙古族自治县","210900"));
				map.put("210922",new Area("210922","彰武县","210900"));
			
			map.put("211000",new Area("211000","辽阳市","210000"));
				map.put("211002",new Area("211002","白塔区","211000"));
				map.put("211003",new Area("211003","文圣区","211000"));
				map.put("211004",new Area("211004","宏伟区","211000"));
				map.put("211005",new Area("211005","弓长岭区","211000"));
				map.put("211011",new Area("211011","太子河区","211000"));
				map.put("211021",new Area("211021","辽阳县","211000"));
				map.put("211081",new Area("211081","灯塔市","211000"));
			
			
			map.put("211100",new Area("211100","盘锦市","210000"));
				map.put("211102",new Area("211102","双台子区","211100"));
				map.put("211103",new Area("211103","兴隆台区","211100"));
				map.put("211121",new Area("211121","大洼县","211100"));
				map.put("211122",new Area("211122","盘山县","211100"));
			
			
			map.put("211200",new Area("211200","铁岭市","210000"));
				map.put("211202",new Area("211202","银州区","211200"));
				map.put("211204",new Area("211204","清河区","211200"));
				map.put("211221",new Area("211221","铁岭县","211200"));
				map.put("211223",new Area("211223","西丰县","211200"));
				map.put("211224",new Area("211224","昌图县","211200"));
				map.put("211281",new Area("211281","调兵山市","211200"));
				map.put("211282",new Area("211282","开原市","211200"));
			
			map.put("211300",new Area("211300","朝阳市","210000"));
				map.put("211302",new Area("211302","双塔区","211300"));
				map.put("211303",new Area("211303","龙城区","211300"));
				map.put("211321",new Area("211321","朝阳县","211300"));
				map.put("211322",new Area("211322","建平县","211300"));
				map.put("211324",new Area("211324","喀喇沁左翼蒙古族自治县","211300"));
				map.put("211381",new Area("211381","北票市","211300"));
				map.put("211382",new Area("211382","凌源市","211300"));
			
			
			map.put("211400",new Area("211400","葫芦岛市","210000"));
				map.put("211402",new Area("211402","连山区","211400"));
				map.put("211403",new Area("211403","龙港区","211400"));
				map.put("211404",new Area("211404","南票区","211400"));
				map.put("211421",new Area("211421","绥中县","211400"));
				map.put("211422",new Area("211422","建昌县","211400"));
				map.put("211481",new Area("211481","兴城市","211400"));
		
		/*
		 * 吉林省
		 */
		map.put("220000",new Area("220000","吉林省","0"));
			map.put("220100",new Area("220100","长春市","220000"));
				map.put("220102",new Area("220102","南关区","220000"));
				map.put("220103",new Area("220103","宽城区","220000"));
				map.put("220104",new Area("220104","朝阳区","220000"));
				map.put("220105",new Area("220105","二道区","220000"));
				map.put("220106",new Area("220106","绿园区","220000"));
				map.put("220112",new Area("220112","双阳区","220000"));
				map.put("220122",new Area("220122","农安县","220000"));
				map.put("220181",new Area("220181","九台市","220000"));
				map.put("220182",new Area("220182","榆树市","220000"));
				map.put("220183",new Area("220183","德惠市","220000"));
				map.put("220184",new Area("220184","高新技术产业开发区","220000"));
				map.put("220185",new Area("220185","汽车产业开发区","220000"));
				map.put("220186",new Area("220186","经济技术开发区","220000"));
				map.put("220187",new Area("220187","净月旅游开发区","220000"));
			
			map.put("220200",new Area("220200","吉林市","220000"));
				map.put("220202",new Area("220202","昌邑区","220200"));
				map.put("220203",new Area("220203","龙潭区","220200"));
				map.put("220204",new Area("220204","船营区","220200"));
				map.put("220211",new Area("220211","丰满区","220200"));
				map.put("220221",new Area("220221","永吉县","220200"));
				map.put("220281",new Area("220281","蛟河市","220200"));
				map.put("220282",new Area("220282","桦甸市","220200"));
				map.put("220283",new Area("220283","舒兰市","220200"));
				map.put("220284",new Area("220284","磐石市","220200"));
			
			map.put("220300",new Area("220300","四平市","220000"));
				map.put("220302",new Area("220302","铁西区","220300"));
				map.put("220303",new Area("220303","铁东区","220300"));
				map.put("220322",new Area("220322","梨树县","220300"));
				map.put("220323",new Area("220323","伊通满族自治县","220300"));
				map.put("220381",new Area("220381","公主岭市","220300"));
				map.put("220382",new Area("220382","双辽市","220300"));
			
			map.put("220400",new Area("220400","辽源市","220000"));
				map.put("220402",new Area("220402","龙山区","220400"));
				map.put("220403",new Area("220403","西安区","220400"));
				map.put("220421",new Area("220421","东丰县","220400"));
				map.put("220422",new Area("220422","东辽县","220400"));
			
			map.put("220500",new Area("220500","通化市","220000"));
				map.put("220500",new Area("220500","东昌区","220500"));
				map.put("220500",new Area("220500","二道江区","220500"));
				map.put("220500",new Area("220500","通化县","220500"));
				map.put("220500",new Area("220500","辉南县","220500"));
				map.put("220500",new Area("220500","柳河县","220500"));
				map.put("220500",new Area("220500","梅河口市","220500"));
				map.put("220500",new Area("220500","集安市","220500"));
			
			map.put("220600",new Area("220600","白山市","220000"));
				map.put("220602",new Area("220602","八道江区","220600"));
				map.put("220621",new Area("220621","抚松县","220600"));
				map.put("220622",new Area("220622","靖宇县","220600"));
				map.put("220623",new Area("220623","长白朝鲜族自治县","220600"));
				map.put("220625",new Area("220625","江源市","220600"));
				map.put("220681",new Area("220681","临江市","220600"));
			
			map.put("220700",new Area("220700","松原市","220000"));
				map.put("220702",new Area("220702","宁江区","220700"));
				map.put("220721",new Area("220721","前郭尔罗斯蒙古族自治县","220700"));
				map.put("220722",new Area("220722","长岭县","220700"));
				map.put("220723",new Area("220723","乾安县","220700"));
				map.put("220724",new Area("220724","扶余县","220700"));
			
			map.put("220800",new Area("220800","白城市","220000"));
				map.put("220802",new Area("220802","洮北区","220800"));
				map.put("220821",new Area("220821","镇赉县","220800"));
				map.put("220822",new Area("220822","通榆县","220800"));
				map.put("220881",new Area("220881","洮南市","220800"));
				map.put("220882",new Area("220882","大安市","220800"));
			
			map.put("224000",new Area("224000","延边朝鲜族自治州","220000"));
				map.put("224001",new Area("224001","延吉市","224000"));
				map.put("224002",new Area("224002","图们市","224000"));
				map.put("224003",new Area("224003","敦化市","224000"));
				map.put("224004",new Area("224004","珲春市","224000"));
				map.put("224005",new Area("224005","龙井市","224000"));
				map.put("224006",new Area("224006","和龙市","224000"));
				map.put("224024",new Area("224024","汪清县","224000"));
				map.put("224026",new Area("224026","安图县","224000"));
		
		/*
		 * 黑龙江省
		 */
		map.put("230000",new Area("230000","黑龙江省","0"));
			map.put("230100",new Area("230100","哈尔滨市","230000"));
				map.put("230102",new Area("230102","道里区","230100"));
				map.put("230103",new Area("230103","南岗区","230100"));
				map.put("230104",new Area("230104","道外区","230100"));
				map.put("230106",new Area("230106","香坊区","230100"));
				map.put("230107",new Area("230107","动力区","230100"));
				map.put("230108",new Area("230108","平房区","230100"));
				map.put("230109",new Area("230109","松北区","230100"));
				map.put("230111",new Area("230111","呼兰区","230100"));
				map.put("230123",new Area("230123","依兰县","230100"));
				map.put("230124",new Area("230124","方正县","230100"));
				map.put("230125",new Area("230125","宾县","230100"));
				map.put("230126",new Area("230126","巴彦县","230100"));
				map.put("230127",new Area("230127","木兰县","230100"));
				map.put("230128",new Area("230128","通河县","230100"));
				map.put("230129",new Area("230129","延寿县","230100"));
				map.put("230181",new Area("230181","阿城市","230100"));
				map.put("230182",new Area("230182","双城市","230100"));
				map.put("230183",new Area("230183","尚志市","230100"));
				map.put("230184",new Area("230184","五常市","230100"));
				map.put("230185",new Area("230185","阿城市","230100"));
			
			
			map.put("230200",new Area("230200","齐齐哈尔市","230000"));
				map.put("230202",new Area("230202","龙沙区","230200"));
				map.put("230203",new Area("230203","建华区","230200"));
				map.put("230204",new Area("230204","铁锋区","230200"));
				map.put("230205",new Area("230205","昂昂溪区","230200"));
				map.put("230206",new Area("230206","富拉尔基区","230200"));
				map.put("230207",new Area("230207","碾子山区","230200"));
				map.put("230208",new Area("230208","梅里斯达斡尔族区","230200"));
				map.put("230221",new Area("230221","龙江县","230200"));
				map.put("230223",new Area("230223","依安县","230200"));
				map.put("230224",new Area("230224","泰来县","230200"));
				map.put("230225",new Area("230225","甘南县","230200"));
				map.put("230227",new Area("230227","富裕县","230200"));
				map.put("230229",new Area("230229","克山县","230200"));
				map.put("230230",new Area("230230","克东县","230200"));
				map.put("230231",new Area("230231","拜泉县","230200"));
				map.put("230281",new Area("230291","讷河市","230200"));
			
			
			map.put("230300",new Area("230300","鸡西市","230000"));
				map.put("230302",new Area("230302","鸡冠区","230300"));
				map.put("230303",new Area("230303","恒山区","230300"));
				map.put("230304",new Area("230304","滴道区","230300"));
				map.put("230305",new Area("230305","梨树区","230300"));
				map.put("230306",new Area("230306","城子河区","230300"));
				map.put("230307",new Area("230307","麻山区","230300"));
				map.put("230321",new Area("230321","鸡东县","230300"));
				map.put("230381",new Area("230381","虎林市","230300"));
				map.put("230382",new Area("230382","密山市","230300"));
			
			
			map.put("230400",new Area("230400","鹤岗市","230000"));
				map.put("230402",new Area("230402","向阳区","230400"));
				map.put("230403",new Area("230403","工农区","230400"));
				map.put("230404",new Area("230404","南山区","230400"));
				map.put("230405",new Area("230405","兴安区","230400"));
				map.put("230406",new Area("230406","东山区","230400"));
				map.put("230407",new Area("230407","兴山区","230400"));
				map.put("230421",new Area("230421","萝北县","230400"));
				map.put("230422",new Area("230422","绥滨县","230400"));
			
			
			map.put("230500",new Area("230500","双鸭山市","230000"));
				map.put("230502",new Area("230502","尖山区","230500"));
				map.put("230503",new Area("230503","岭东区","230500"));
				map.put("230505",new Area("230505","四方台区","230500"));
				map.put("230506",new Area("230506","宝山区","230500"));
				map.put("230521",new Area("230521","集贤县","230500"));
				map.put("230522",new Area("230522","友谊县","230500"));
				map.put("230523",new Area("230523","宝清县","230500"));
				map.put("230524",new Area("230524","饶河县","230500"));
			
			
			map.put("230600",new Area("230600","大庆市","230000"));
				map.put("230602",new Area("230602","萨尔图区","230600"));
				map.put("230603",new Area("230603","龙凤区","230600"));
				map.put("230604",new Area("230604","让胡路区","230600"));
				map.put("230605",new Area("230605","红岗区","230600"));
				map.put("230606",new Area("230606","大同区","230600"));
				map.put("230621",new Area("230621","肇州县","230600"));
				map.put("230622",new Area("230622","肇源县","230600"));
				map.put("230623",new Area("230623","林甸县","230600"));
				map.put("230624",new Area("230624","杜尔伯特蒙古族自治县","230600"));
			
			
			map.put("230700",new Area("230700","伊春市","230000"));
				map.put("230702",new Area("230702","伊春区","230700"));
				map.put("230703",new Area("230703","南岔区","230700"));
				map.put("230704",new Area("230704","友好区","230700"));
				map.put("230705",new Area("230705","西林区","230700"));
				map.put("230706",new Area("230706","翠峦区","230700"));
				map.put("230707",new Area("230707","新青区","230700"));
				map.put("230708",new Area("230708","美溪区","230700"));
				map.put("230709",new Area("230709","金山屯区","230700"));
				map.put("230710",new Area("230710","五营区","230700"));
				map.put("230711",new Area("230711","乌马河区","230700"));
				map.put("230712",new Area("230712","汤旺河区","230700"));
				map.put("230713",new Area("230713","带岭区","230700"));
				map.put("230714",new Area("230714","乌伊岭区","230700"));
				map.put("230715",new Area("230715","红星区","230700"));
				map.put("230716",new Area("230716","上甘岭区","230700"));
				map.put("230722",new Area("230722","嘉荫县","230700"));
				map.put("230781",new Area("230781","铁力市","230700"));
			
			
			map.put("230800",new Area("230800","佳木斯市","230000"));
				map.put("230802",new Area("230802","永红区","230800"));
				map.put("230803",new Area("230803","向阳区","230800"));
				map.put("230804",new Area("230804","前进区","230800"));
				map.put("230805",new Area("230805","东风区","230800"));
				map.put("230811",new Area("230811","郊区","230800"));
				map.put("230822",new Area("230822","桦南县","230800"));
				map.put("230826",new Area("230826","桦川县","230800"));
				map.put("230828",new Area("230828","汤原县","230800"));
				map.put("230833",new Area("230833","抚远县","230800"));
				map.put("230881",new Area("230881","同江市","230800"));
				map.put("230882",new Area("230882","富锦市","230800"));
			
			
			map.put("230900",new Area("230900","七台河市","230000"));
				map.put("230902",new Area("230902","新兴区","230900"));
				map.put("230903",new Area("230903","桃山区","230900"));
				map.put("230904",new Area("230904","茄子河区","230900"));
				map.put("230921",new Area("230921","勃利县","230900"));
			
			
			map.put("231000",new Area("231000","牡丹江市","230000"));
				map.put("231002",new Area("231002","东安区","231000"));
				map.put("231003",new Area("231003","阳明区","231000"));
				map.put("231004",new Area("231004","爱民区","231000"));
				map.put("231005",new Area("231005","西安区","231000"));
				map.put("231024",new Area("231024","东宁县","231000"));
				map.put("231025",new Area("231025","林口县","231000"));
				map.put("231081",new Area("231081","绥芬河市","231000"));
				map.put("231083",new Area("231083","海林市","231000"));
				map.put("231084",new Area("231084","宁安市","231000"));
				map.put("231085",new Area("231085","穆棱市","231000"));
			
			
			map.put("231100",new Area("231100","黑河市","230000"));
				map.put("231102",new Area("231102","爱辉区","231100"));
				map.put("231121",new Area("231121","嫩江县","231100"));
				map.put("231123",new Area("231123","逊克县","231100"));
				map.put("231124",new Area("231124","孙吴县","231100"));
				map.put("231181",new Area("231181","北安市","231100"));
				map.put("231182",new Area("231182","五大连池市","231100"));
			
			map.put("231200",new Area("231200","绥化市","230000"));
				map.put("231202",new Area("231202","北林区","231200"));
				map.put("231221",new Area("231221","望奎县","231200"));
				map.put("231222",new Area("231222","兰西县","231200"));
				map.put("231223",new Area("231223","青冈县","231200"));
				map.put("231224",new Area("231224","庆安县","231200"));
				map.put("231225",new Area("231225","明水县","231200"));
				map.put("231226",new Area("231226","绥棱县","231200"));
				map.put("231281",new Area("231281","安达市","231200"));
				map.put("231282",new Area("231282","肇东市","231200"));
				map.put("231283",new Area("231283","海伦市","231200"));
			
			
			map.put("232700",new Area("232700","大兴安岭地区","230000"));
				map.put("232721",new Area("232721","呼玛县","232700"));
				map.put("232722",new Area("232722","塔河县","232700"));
				map.put("232723",new Area("232723","漠河县","232700"));
				map.put("232724",new Area("232724","加格达奇区","232700"));
		
		/*
		 * 上海
		 */
		map.put("310000",new Area("310000","上海","0"));
			map.put("310100",new Area("310100","上海市","310000"));
				map.put("310101",new Area("310101","黄浦区","310100"));
				map.put("310103",new Area("310103","卢湾区","310100"));
				map.put("310104",new Area("310104","徐汇区","310100"));
				map.put("310105",new Area("310105","长宁区","310100"));
				map.put("310106",new Area("310106","静安区","310100"));
				map.put("310107",new Area("310107","普陀区","310100"));
				map.put("310108",new Area("310108","闸北区","310100"));
				map.put("310109",new Area("310109","虹口区","310100"));
				map.put("310110",new Area("310110","杨浦区","310100"));
				map.put("310112",new Area("310112","闵行区","310100"));
				map.put("310113",new Area("310113","宝山区","310100"));
				map.put("310114",new Area("310114","嘉定区","310100"));
				map.put("310115",new Area("310115","浦东新区","310100"));
				map.put("310116",new Area("310116","金山区","310100"));
				map.put("310117",new Area("310117","松江区","310100"));
				map.put("310118",new Area("310118","青浦区","310100"));
				map.put("310119",new Area("310119","南汇区","310100"));
				map.put("310120",new Area("310120","奉贤区","310100"));
				map.put("310152",new Area("310152","川沙区","310100"));
				map.put("310230",new Area("310230","崇明县","310100"));
		
		/*
		 * 江苏省
		 */
		map.put("320000",new Area("320000","江苏省","0"));
			map.put("320100",new Area("320100","南京市","320000"));
				map.put("320102",new Area("320102","玄武区","320100"));
				map.put("320103",new Area("320103","白下区","320100"));
				map.put("320104",new Area("320104","秦淮区","320100"));
				map.put("320105",new Area("320105","建邺区","320100"));
				map.put("320106",new Area("320106","鼓楼区","320100"));
				map.put("320107",new Area("320107","下关区","320100"));
				map.put("320111",new Area("320111","浦口区","320100"));
				map.put("320113",new Area("320113","栖霞区","320100"));
				map.put("320114",new Area("320114","雨花台区","320100"));
				map.put("320115",new Area("320115","江宁区","320100"));
				map.put("320116",new Area("320116","六合区","320100"));
				map.put("320124",new Area("320124","溧水县","320100"));
				map.put("320125",new Area("320125","高淳县","320100"));
			
			
			map.put("320200",new Area("320200","无锡市","320000"));
				map.put("320202",new Area("320202","崇安区","320200"));
				map.put("320203",new Area("320203","南长区","320200"));
				map.put("320204",new Area("320204","北塘区","320200"));
				map.put("320205",new Area("320205","锡山区","320200"));
				map.put("320206",new Area("320206","惠山区","320200"));
				map.put("320211",new Area("320211","滨湖区","320200"));
				map.put("320281",new Area("320282","江阴市","320200"));
				map.put("320282",new Area("320282","宜兴市","320200"));
				map.put("320296",new Area("320296","新区","320200"));
			
			
			map.put("320300",new Area("320300","徐州市","320000"));
				map.put("320302",new Area("320302","鼓楼区","320300"));
				map.put("320303",new Area("320303","云龙区","320300"));
				map.put("320304",new Area("320304","九里区","320300"));
				map.put("320305",new Area("320305","贾汪区","320300"));
				map.put("320311",new Area("320311","泉山区","320300"));
				map.put("320321",new Area("320321","丰县","320300"));
				map.put("320322",new Area("320322","沛县","320300"));
				map.put("320323",new Area("320323","铜山县","320300"));
				map.put("320324",new Area("320324","睢宁县","320300"));
				map.put("320381",new Area("320381","新沂市","320300"));
				map.put("320382",new Area("320382","邳州市","320300"));
			
			
			map.put("320400",new Area("320400","常州市","320000"));
				map.put("320402",new Area("320402","天宁区","320400"));
				map.put("320404",new Area("320404","钟楼区","320400"));
				map.put("320405",new Area("320405","戚墅堰区","320400"));
				map.put("320411",new Area("320411","新北区","320400"));
				map.put("320412",new Area("320412","武进区","320400"));
				map.put("320481",new Area("320481","溧阳市","320400"));
				map.put("320482",new Area("320482","金坛市","320400"));
			
			map.put("320500",new Area("320500","苏州市","320000"));
				map.put("320502",new Area("320502","沧浪区","320500"));
				map.put("320503",new Area("320503","平江区","320500"));
				map.put("320504",new Area("320504","金阊区","320500"));
				map.put("320505",new Area("320505","虎丘区","320500"));
				map.put("320506",new Area("320506","吴中区","320500"));
				map.put("320507",new Area("320507","相城区","320500"));
				map.put("320581",new Area("320581","常熟市","320500"));
				map.put("320582",new Area("320582","张家港市","320500"));
				map.put("320583",new Area("320583","昆山市","320500"));
				map.put("320584",new Area("320584","吴江市","320500"));
				map.put("320585",new Area("320585","太仓市","320500"));
				map.put("320594",new Area("320594","新区","320500"));
				map.put("320595",new Area("320595","园区","320500"));
			
			
			map.put("320600",new Area("320600","南通市","320000"));
				map.put("320602",new Area("320602","崇川区","320600"));
				map.put("320611",new Area("320611","港闸区","320600"));
				map.put("320612",new Area("320612","通州区","320600"));
				map.put("320621",new Area("320621","海安县","320600"));
				map.put("320623",new Area("320623","如东县","320600"));
				map.put("320681",new Area("320681","启东市","320600"));
				map.put("320682",new Area("320682","如皋市","320600"));
				map.put("320683",new Area("320683","通州市","320600"));
				map.put("320684",new Area("320684","海门市","320600"));
				map.put("320693",new Area("320693","开发区","320600"));
			
			
			map.put("320700",new Area("320700","连云港市","320000"));
				map.put("320703",new Area("320703","连云区","320700"));
				map.put("320705",new Area("320705","新浦区","320700"));
				map.put("320706",new Area("320706","海州区","320700"));
				map.put("320721",new Area("320721","赣榆县","320700"));
				map.put("320722",new Area("320722","东海县","320700"));
				map.put("320723",new Area("320723","灌云县","320700"));
				map.put("320724",new Area("320724","灌南县","320700"));
			
			
			map.put("320800",new Area("320800","淮安市","320000"));
				map.put("320802",new Area("320802","清河区","320800"));
				map.put("320803",new Area("320803","楚州区","320800"));
				map.put("320804",new Area("320804","淮阴区","320800"));
				map.put("320811",new Area("320811","清浦区","320800"));
				map.put("320826",new Area("320826","涟水县","320800"));
				map.put("320829",new Area("320829","洪泽县","320800"));
				map.put("320830",new Area("320830","盱眙县","320800"));
				map.put("320831",new Area("320831","金湖县","320800"));
			
			
			map.put("320900",new Area("320900","盐城市","320000"));
				map.put("320902",new Area("320902","亭湖区","320900"));
				map.put("320903",new Area("320903","盐都区","320900"));
				map.put("320921",new Area("320921","响水县","320900"));
				map.put("320922",new Area("320922","滨海县","320900"));
				map.put("320923",new Area("320923","阜宁县","320900"));
				map.put("320924",new Area("320924","射阳县","320900"));
				map.put("320925",new Area("320925","建湖县","320900"));
				map.put("320981",new Area("320981","东台市","320900"));
				map.put("320982",new Area("320982","大丰市","320900"));
			
			
			map.put("321000",new Area("321000","扬州市","320000"));
				map.put("321002",new Area("321002","广陵区","321000"));
				map.put("321003",new Area("321003","邗江区","321000"));
				map.put("321011",new Area("321011","维扬区","321000"));
				map.put("321023",new Area("321023","宝应县","321000"));
				map.put("321081",new Area("321081","仪征市","321000"));
				map.put("321084",new Area("321084","高邮市","321000"));
				map.put("321088",new Area("321088","江都市","321000"));
				map.put("321092",new Area("321092","经济开发区","321000"));
			
			
			map.put("321100",new Area("321100","镇江市","320000"));
				map.put("321102",new Area("321102","京口区","321100"));
				map.put("321111",new Area("321111","润州区","321100"));
				map.put("321112",new Area("321112","丹徒区","321100"));
				map.put("321181",new Area("321181","丹阳市","321100"));
				map.put("321182",new Area("321182","扬中市","321100"));
				map.put("321183",new Area("321183","句容市","321100"));
			
			
			map.put("321200",new Area("321200","泰州市","320000"));
				map.put("321202",new Area("321202","海陵区","321200"));
				map.put("321203",new Area("321203","高港区","321200"));
				map.put("321281",new Area("321281","兴化市","321200"));
				map.put("321282",new Area("321282","靖江市","321200"));
				map.put("321283",new Area("321283","泰兴市","321200"));
				map.put("321284",new Area("321284","姜堰市","321200"));
			
			
			map.put("321300",new Area("321300","宿迁市","320000"));
				map.put("321302",new Area("321302","宿城区","321300"));
				map.put("321311",new Area("321311","宿豫区","321300"));
				map.put("321322",new Area("321322","沭阳县","321300"));
				map.put("321323",new Area("321323","泗阳县","321300"));
				map.put("321324",new Area("321324","泗洪县","321300"));
		
		/*
		 * 浙江省
		 */
		map.put("330000",new Area("330000","浙江省","0"));
			map.put("330100",new Area("330100","杭州市","330000"));
				map.put("330102",new Area("330102","上城区","330100"));
				map.put("330103",new Area("330103","下城区","330100"));
				map.put("330104",new Area("330104","江干区","330100"));
				map.put("330105",new Area("330105","拱墅区","330100"));
				map.put("330106",new Area("330106","西湖区","330100"));
				map.put("330108",new Area("330108","滨江区","330100"));
				map.put("330109",new Area("330109","萧山区","330100"));
				map.put("330110",new Area("330110","余杭区","330100"));
				map.put("330122",new Area("330122","桐庐县","330100"));
				map.put("330127",new Area("330127","淳安县","330100"));
				map.put("330182",new Area("330182","建德市","330100"));
				map.put("330183",new Area("330183","富阳市","330100"));
				map.put("330185",new Area("330185","临安市","330100"));
			
			
			map.put("330200",new Area("330200","宁波市","330000"));
				map.put("330203",new Area("330203","海曙区","330200"));
				map.put("330204",new Area("330204","江东区","330200"));
				map.put("330205",new Area("330205","江北区","330200"));
				map.put("330206",new Area("330206","北仑区","330200"));
				map.put("330211",new Area("330211","镇海区","330200"));
				map.put("330212",new Area("330212","鄞州区","330200"));
				map.put("330225",new Area("330225","象山县","330200"));
				map.put("330226",new Area("330226","宁海县","330200"));
				map.put("330281",new Area("330281","余姚市","330200"));
				map.put("330282",new Area("330282","慈溪市","330200"));
				map.put("330283",new Area("330283","奉化市","330200"));
			
			
			map.put("330300",new Area("330300","温州市","330000"));
				map.put("330302",new Area("330302","鹿城区","330300"));
				map.put("330303",new Area("330303","龙湾区","330300"));
				map.put("330304",new Area("330304","瓯海区","330300"));
				map.put("330322",new Area("330322","洞头县","330300"));
				map.put("330324",new Area("330324","永嘉县","330300"));
				map.put("330326",new Area("330326","平阳县","330300"));
				map.put("330327",new Area("330327","苍南县","330300"));
				map.put("330328",new Area("330328","文成县","330300"));
				map.put("330329",new Area("330329","泰顺县","330300"));
				map.put("330381",new Area("330381","瑞安市","330300"));
				map.put("330382",new Area("330382","乐清市","330300"));
			
			
			map.put("330400",new Area("330400","嘉兴市","330000"));
				map.put("330402",new Area("330402","南湖区","330400"));
				map.put("330411",new Area("330411","秀洲区","330400"));
				map.put("330421",new Area("330421","嘉善县","330400"));
				map.put("330424",new Area("330424","海盐县","330400"));
				map.put("330481",new Area("330481","海宁市","330400"));
				map.put("330482",new Area("330482","平湖市","330400"));
				map.put("330483",new Area("330483","桐乡市","330400"));
			
			
			map.put("330500",new Area("330500","湖州市","330000"));
				map.put("330502",new Area("330502","吴兴区","330500"));
				map.put("330503",new Area("330503","南浔区","330500"));
				map.put("330521",new Area("330521","德清县","330500"));
				map.put("330522",new Area("330522","长兴县","330500"));
				map.put("330523",new Area("330523","安吉县","330500"));
			
			
			map.put("330600",new Area("330600","绍兴市","330000"));
				map.put("330602",new Area("330602","越城区","330600"));
				map.put("330621",new Area("330621","绍兴县","330600"));
				map.put("330624",new Area("330624","新昌县","330600"));
				map.put("330681",new Area("330681","诸暨市","330600"));
				map.put("330682",new Area("330682","上虞市","330600"));
				map.put("330683",new Area("3306083","嵊州市","330600"));
			
			
			map.put("330700",new Area("330700","金华市","330000"));
				map.put("330702",new Area("330702","婺城区","330700"));
				map.put("330703",new Area("330703","金东区","330700"));
				map.put("330723",new Area("330723","武义县","330700"));
				map.put("330726",new Area("330726","浦江县","330700"));
				map.put("330727",new Area("330727","磐安县","330700"));
				map.put("330781",new Area("330781","兰溪市","330700"));
				map.put("330782",new Area("330782","义乌市","330700"));
				map.put("330783",new Area("330783","东阳市","330700"));
				map.put("330784",new Area("330784","永康市","330700"));
			
			
			map.put("330800",new Area("330800","衢州市","330000"));
				map.put("330802",new Area("330802","柯城区","330800"));
				map.put("330803",new Area("330803","衢江区","330800"));
				map.put("330822",new Area("330822","常山县","330800"));
				map.put("330824",new Area("330824","开化县","330800"));
				map.put("330825",new Area("330825","龙游县","330800"));
				map.put("330881",new Area("330881","江山市","330800"));
			
			
			map.put("330900",new Area("330900","舟山市","330000"));
				map.put("330902",new Area("330902","定海区","330900"));
				map.put("330903",new Area("330903","普陀区","330900"));
				map.put("330921",new Area("330921","岱山县","330900"));
				map.put("330922",new Area("330922","嵊泗县","330900"));
			
			
			map.put("331000",new Area("331000","台州市","330000"));
				map.put("331002",new Area("331002","椒江区","331000"));
				map.put("331003",new Area("331003","黄岩区","331000"));
				map.put("331004",new Area("331004","路桥区","331000"));
				map.put("331021",new Area("331021","玉环县","331000"));
				map.put("331022",new Area("331022","三门县","331000"));
				map.put("331023",new Area("331023","天台县","331000"));
				map.put("331024",new Area("331024","仙居县","331000"));
				map.put("331081",new Area("331081","温岭市","331000"));
				map.put("331082",new Area("331082","临海市","331000"));
			
			
			map.put("331100",new Area("331100","丽水市","330000"));
				map.put("331102",new Area("331102","莲都区","331100"));
				map.put("331121",new Area("331121","青田县","331100"));
				map.put("331122",new Area("331122","缙云县","331100"));
				map.put("331123",new Area("331123","遂昌县","331100"));
				map.put("331124",new Area("331124","松阳县","331100"));
				map.put("331125",new Area("331125","云和县","331100"));
				map.put("331126",new Area("331126","庆元县","331100"));
				map.put("331127",new Area("331127","景宁畲族自治县","331100"));
				map.put("331181",new Area("331181","龙泉市","331100"));
		
		/*
		 * 安徽省
		 */
		map.put("340000",new Area("340000","安徽省","0"));
			map.put("340100",new Area("340100","合肥市","340000"));
				map.put("340102",new Area("340102","瑶海区","340100"));
				map.put("340103",new Area("340103","庐阳区","340100"));
				map.put("340104",new Area("340104","蜀山区","340100"));
				map.put("340111",new Area("340111","包河区","340100"));
				map.put("340121",new Area("340121","长丰县","340100"));
				map.put("340122",new Area("340122","肥东县","340100"));
				map.put("340123",new Area("340123","肥西县","340100"));
				map.put("340151",new Area("340151","高新区","340100"));
				map.put("340191",new Area("340191","中区","340100"));
				map.put("341400",new Area("341400","巢湖市","340100"));
				map.put("341402",new Area("341402","居巢区","340100"));
				map.put("341421",new Area("341421","庐江县","340100"));
				
			
			map.put("340200",new Area("340200","芜湖市","340000"));
				map.put("340202",new Area("340202","镜湖区","340200"));
				map.put("340203",new Area("340203","弋江区","340200"));
				map.put("340207",new Area("340207","鸠江区","340200"));
				map.put("340208",new Area("340208","三山区","340200"));
				map.put("340221",new Area("340221","芜湖县","340200"));
				map.put("340222",new Area("340222","繁昌县","340200"));
				map.put("340223",new Area("340223","南陵县","340200"));
				map.put("341422",new Area("341422","无为县","340200"));
			
			
			map.put("340300",new Area("340300","蚌埠市","340000"));
				map.put("340302",new Area("340302","龙子湖区","340300"));
				map.put("340303",new Area("340303","蚌山区","340300"));
				map.put("340304",new Area("340304","禹会区","340300"));
				map.put("340311",new Area("340311","淮上区","340300"));
				map.put("340321",new Area("340321","怀远县","340300"));
				map.put("340322",new Area("340322","五河县","340300"));
				map.put("340323",new Area("340323","固镇县","340300"));
			
			
			map.put("340400",new Area("340400","淮南市","340000"));
				map.put("340402",new Area("340402","大通区","340400"));
				map.put("340403",new Area("340403","田家庵区","340400"));
				map.put("340404",new Area("340404","谢家集区","340400"));
				map.put("340405",new Area("340405","八公山区","340400"));
				map.put("340406",new Area("340406","潘集区","340400"));
				map.put("340421",new Area("340421","凤台县","340400"));
			
			
			map.put("340500",new Area("340500","马鞍山市","340000"));
				map.put("340502",new Area("340502","金家庄区","340500"));
				map.put("340503",new Area("340503","花山区","340500"));
				map.put("340504",new Area("340504","雨山区","340500"));
				map.put("340521",new Area("340521","当涂县","340500"));
				map.put("340523",new Area("340523","含山县","340500"));
				map.put("340524",new Area("340524","和县","340500"));
			
			
			map.put("340600",new Area("340600","淮北市","340000"));
				map.put("340602",new Area("340602","杜集区","340600"));
				map.put("340603",new Area("340603","相山区","340600"));
				map.put("340604",new Area("340604","烈山区","340600"));
				map.put("340621",new Area("340621","濉溪县","340600"));
			
			
			map.put("340700",new Area("340700","铜陵市","340000"));
				map.put("340702",new Area("340702","铜官山区","340700"));
				map.put("340703",new Area("340703","狮子山区","340700"));
				map.put("340711",new Area("340711","郊区","340700"));
				map.put("340721",new Area("340721","铜陵县","340700"));
			
			
			map.put("340800",new Area("340800","安庆市","340000"));
				map.put("340802",new Area("340802","迎江区","340800"));
				map.put("340803",new Area("340803","大观区","340800"));
				map.put("340811",new Area("340811","宜秀区","340800"));
				map.put("340822",new Area("340822","怀宁县","340800"));
				map.put("340823",new Area("340823","枞阳县","340800"));
				map.put("340824",new Area("340824","潜山县","340800"));
				map.put("340825",new Area("340825","太湖县","340800"));
				map.put("340826",new Area("340826","宿松县","340800"));
				map.put("340827",new Area("340827","望江县","340800"));
				map.put("340828",new Area("340828","岳西县","340800"));
				map.put("340881",new Area("340881","桐城市","340800"));
			
			
			map.put("341000",new Area("341000","黄山市","340000"));
				map.put("341002",new Area("341002","屯溪区","341000"));
				map.put("341003",new Area("341003","黄山区","341000"));
				map.put("341004",new Area("341004","徽州区","341000"));
				map.put("341021",new Area("341021","歙县","341000"));
				map.put("341022",new Area("341022","休宁县","341000"));
				map.put("341023",new Area("341023","黟县","341000"));
				map.put("341024",new Area("341024","祁门县","341000"));
			
			
			map.put("341100",new Area("341100","滁州市","340000"));
				map.put("341102",new Area("341102","琅琊区","341100"));
				map.put("341103",new Area("341103","南谯区","341100"));
				map.put("341122",new Area("341122","来安县","341100"));
				map.put("341124",new Area("341124","全椒县","341100"));
				map.put("341125",new Area("341125","定远县","341100"));
				map.put("341126",new Area("341126","凤阳县","341100"));
				map.put("341181",new Area("341181","天长市","341100"));
				map.put("341182",new Area("341182","明光市","341100"));
			
			
			map.put("341200",new Area("341200","阜阳市","340000"));
				map.put("341202",new Area("341202","颍州区","341200"));
				map.put("341203",new Area("341203","颍东区","341200"));
				map.put("341204",new Area("341204","颍泉区","341200"));
				map.put("341221",new Area("341221","临泉县","341200"));
				map.put("341222",new Area("341222","太和县","341200"));
				map.put("341225",new Area("341225","阜南县","341200"));
				map.put("341226",new Area("341226","颍上县","341200"));
				map.put("341282",new Area("341282","界首市","341200"));
			
			
			map.put("341300",new Area("341300","宿州市","340000"));
				map.put("341302",new Area("341302","埇桥区","341300"));
				map.put("341321",new Area("341321","砀山县","341300"));
				map.put("341322",new Area("341322","萧县","341300"));
				map.put("341323",new Area("341323","灵璧县","341300"));
				map.put("341324",new Area("341324","泗县","341300"));
			
			
			map.put("341500",new Area("341500","六安市","340000"));
				map.put("341502",new Area("341502","金安区","341500"));
				map.put("341503",new Area("341503","裕安区","341500"));
				map.put("341521",new Area("341521","寿县","341500"));
				map.put("341522",new Area("341522","霍邱县","341500"));
				map.put("341523",new Area("341523","舒城县","341500"));
				map.put("341524",new Area("341524","金寨县","341500"));
				map.put("341525",new Area("341525","霍山县","341500"));
			
				
			map.put("341600",new Area("341600","亳州市","340000"));
				map.put("341602",new Area("341602","谯城区","341600"));
				map.put("341621",new Area("341621","涡阳县","341600"));
				map.put("341622",new Area("341622","蒙城县","341600"));
				map.put("341623",new Area("341623","利辛县","341600"));
			
			
			map.put("341700",new Area("341700","池州市","340000"));
				map.put("341702",new Area("341702","贵池区","341700"));
				map.put("341721",new Area("341721","东至县","341700"));
				map.put("341722",new Area("341722","石台县","341700"));
				map.put("341723",new Area("341723","青阳县","341700"));
			
			
			map.put("341800",new Area("341800","宣城市","340000"));
				map.put("341802",new Area("341802","宣州区","341800"));
				map.put("341821",new Area("341821","郎溪县","341800"));
				map.put("341822",new Area("341822","广德县","341800"));
				map.put("341823",new Area("341823","泾县","341800"));
				map.put("341824",new Area("341824","绩溪县","341800"));
				map.put("341825",new Area("341825","旌德县","341800"));
				map.put("341881",new Area("341881","宁国市","341800"));
		
		/*
		 * 福建省
		 */
		map.put("350000",new Area("350000","福建省","0"));
			map.put("350100",new Area("350100","福州市","350000"));
				map.put("350102",new Area("350102","鼓楼区","350100"));
				map.put("350103",new Area("350103","台江区","350100"));
				map.put("350104",new Area("350104","仓山区","350100"));
				map.put("350105",new Area("350105","马尾区","350100"));
				map.put("350111",new Area("350111","晋安区","350100"));
				map.put("350121",new Area("350121","闽侯县","350100"));
				map.put("350122",new Area("350122","连江县","350100"));
				map.put("350123",new Area("350123","罗源县","350100"));
				map.put("350124",new Area("350124","闽清县","350100"));
				map.put("350125",new Area("350125","永泰县","350100"));
				map.put("350128",new Area("350128","平潭县","350100"));
				map.put("350181",new Area("350181","福清市","350100"));
				map.put("350182",new Area("350182","长乐市","350100"));
			
			map.put("350200",new Area("350200","厦门市","350000"));
				map.put("350203",new Area("350203","思明区","350200"));
				map.put("350205",new Area("350205","海沧区","350200"));
				map.put("350206",new Area("350206","湖里区","350200"));
				map.put("350211",new Area("350211","集美区","350200"));
				map.put("350212",new Area("350212","同安区","350200"));
				map.put("350213",new Area("350213","翔安区","350200"));
			
			
			map.put("350300",new Area("350300","莆田市","350000"));
				map.put("350302",new Area("350302","城厢区","350300"));
				map.put("350303",new Area("350303","涵江区","350300"));
				map.put("350304",new Area("350304","荔城区","350300"));
				map.put("350305",new Area("350305","秀屿区","350300"));
				map.put("350322",new Area("350322","仙游县","350300"));
			
			
			map.put("350400",new Area("350400","三明市","350000"));
				map.put("350402",new Area("350402","梅列区","350400"));
				map.put("350403",new Area("350403","三元区","350400"));
				map.put("350421",new Area("350421","明溪县","350400"));
				map.put("350423",new Area("350423","清流县","350400"));
				map.put("350424",new Area("350424","宁化县","350400"));
				map.put("350425",new Area("350425","大田县","350400"));
				map.put("350426",new Area("350426","尤溪县","350400"));
				map.put("350427",new Area("350427","沙县","350400"));
				map.put("350428",new Area("350428","将乐县","350400"));
				map.put("350429",new Area("350429","泰宁县","350400"));
				map.put("350430",new Area("350430","建宁县","350400"));
				map.put("350481",new Area("350481","永安市","350400"));
			
			
			map.put("350500",new Area("350500","泉州市","350000"));
				map.put("350502",new Area("350502","鲤城区","350500"));
				map.put("350503",new Area("350503","丰泽区","350500"));
				map.put("350504",new Area("350504","洛江区","350500"));
				map.put("350505",new Area("350505","泉港区","350500"));
				map.put("350521",new Area("350521","惠安县","350500"));
				map.put("350524",new Area("350524","安溪县","350500"));
				map.put("350525",new Area("350525","永春县","350500"));
				map.put("350526",new Area("350526","德化县","350500"));
				map.put("350527",new Area("350527","金门县","350500"));
				map.put("350581",new Area("350581","石狮市","350500"));
				map.put("350582",new Area("350582","晋江市","350500"));
				map.put("350583",new Area("350583","南安市","350500"));
			
			
			map.put("350600",new Area("350600","漳州市","350000"));
				map.put("350602",new Area("350602","芗城区","350600"));
				map.put("350603",new Area("350603","龙文区","350600"));
				map.put("350622",new Area("350622","云霄县","350600"));
				map.put("350623",new Area("350623","漳浦县","350600"));
				map.put("350624",new Area("350624","诏安县","350600"));
				map.put("350625",new Area("350625","长泰县","350600"));
				map.put("350626",new Area("350626","东山县","350600"));
				map.put("350627",new Area("350627","南靖县","350600"));
				map.put("350628",new Area("350628","平和县","350600"));
				map.put("350629",new Area("350629","华安县","350600"));
				map.put("350681",new Area("350681","龙海市","350600"));
			
			
			map.put("350700",new Area("350700","南平市","350000"));
				map.put("350702",new Area("350702","延平区","350700"));
				map.put("350721",new Area("350721","顺昌县","350700"));
				map.put("350722",new Area("350722","浦城县","350700"));
				map.put("350723",new Area("350723","光泽县","350700"));
				map.put("350724",new Area("350724","松溪县","350700"));
				map.put("350725",new Area("350725","政和县","350700"));
				map.put("350781",new Area("350781","邵武市","350700"));
				map.put("350782",new Area("350782","武夷山市","350700"));
				map.put("350783",new Area("350783","建瓯市","350700"));
				map.put("350784",new Area("350784","建阳市","350700"));
			
			
			map.put("350800",new Area("350800","龙岩市","350000"));
				map.put("350802",new Area("350802","新罗区","350800"));
				map.put("350821",new Area("350821","长汀县","350800"));
				map.put("350822",new Area("350822","永定县","350800"));
				map.put("350823",new Area("350823","上杭县","350800"));
				map.put("350824",new Area("350824","武平县","350800"));
				map.put("350825",new Area("350825","连城县","350800"));
				map.put("350881",new Area("350881","漳平市","350800"));
			
			
			map.put("350900",new Area("350900","宁德市","350000"));
				map.put("350902",new Area("350902","蕉城区","350900"));
				map.put("350921",new Area("350921","霞浦县","350900"));
				map.put("350922",new Area("350922","古田县","350900"));
				map.put("350923",new Area("350923","屏南县","350900"));
				map.put("350924",new Area("350924","寿宁县","350900"));
				map.put("350925",new Area("350925","周宁县","350900"));
				map.put("350926",new Area("350926","柘荣县","350900"));
				map.put("350981",new Area("350981","福安市","350900"));
				map.put("350982",new Area("350982","福鼎市","350900"));
		
			
		/*
		 * 江西省
		 */
		map.put("360000",new Area("360000","江西省","0"));
			map.put("360100",new Area("360100","南昌市","360000"));
				map.put("360102",new Area("360102","东湖区","360100"));
				map.put("360103",new Area("360103","西湖区","360100"));
				map.put("360104",new Area("360104","青云谱区","360100"));
				map.put("360105",new Area("360105","湾里区","360100"));
				map.put("360111",new Area("360111","青山湖区","360100"));
				map.put("360121",new Area("360121","南昌县","360100"));
				map.put("360122",new Area("360122","新建县","360100"));
				map.put("360123",new Area("360123","安义县","360100"));
				map.put("360124",new Area("360124","进贤县","360100"));
				map.put("360125",new Area("360125","红谷滩新区","360100"));
				map.put("360126",new Area("360126","经济技术开发区","360100"));
				map.put("360127",new Area("360127","昌北区","360100"));
			
			
			map.put("360200",new Area("360200","景德镇市","360000"));
				map.put("360202",new Area("360202","昌江区","360200"));
				map.put("360203",new Area("360203","珠山区","360200"));
				map.put("360222",new Area("360222","浮梁县","360200"));
				map.put("360281",new Area("360281","乐平市","360200"));
			
			
			map.put("360300",new Area("360300","萍乡市","360000"));
				map.put("360302",new Area("360302","安源区","360300"));
				map.put("360313",new Area("360313","湘东区","360300"));
				map.put("360321",new Area("360321","莲花县","360300"));
				map.put("360322",new Area("360322","上栗县","360300"));
				map.put("360323",new Area("360323","芦溪县","360300"));
			
			
			map.put("360400",new Area("360400","九江市","360000"));
				map.put("360402",new Area("360402","庐山区","360400"));
				map.put("360403",new Area("360403","浔阳区","360400"));
				map.put("360421",new Area("360421","九江县","360400"));
				map.put("360423",new Area("360423","武宁县","360400"));
				map.put("360424",new Area("360424","修水县","360400"));
				map.put("360425",new Area("360425","永修县","360400"));
				map.put("360426",new Area("360426","德安县","360400"));
				map.put("360427",new Area("360427","星子县","360400"));
				map.put("360428",new Area("360428","都昌县","360400"));
				map.put("360429",new Area("360429","湖口县","360400"));
				map.put("360430",new Area("360430","彭泽县","360400"));
				map.put("360481",new Area("360481","瑞昌市","360400"));
			
			
			map.put("360500",new Area("360500","新余市","360000"));
				map.put("360502",new Area("360502","渝水区","360500"));
				map.put("360521",new Area("360521","分宜县","360500"));
			
			
			map.put("360600",new Area("360600","鹰潭市","360000"));
				map.put("360602",new Area("360602","月湖区","360600"));
				map.put("360622",new Area("360622","余江县","360600"));
				map.put("360681",new Area("360681","贵溪市","360600"));
			
			
			map.put("360700",new Area("360700","赣州市","360000"));
				map.put("360702",new Area("360702","章贡区","360700"));
				map.put("360721",new Area("360721","赣县","360700"));
				map.put("360722",new Area("360722","信丰县","360700"));
				map.put("360723",new Area("360723","大余县","360700"));
				map.put("360724",new Area("360724","上犹县","360700"));
				map.put("360725",new Area("360725","崇义县","360700"));
				map.put("360726",new Area("360726","安远县","360700"));
				map.put("360727",new Area("360727","龙南县","360700"));
				map.put("360728",new Area("360728","定南县","360700"));
				map.put("360729",new Area("360729","全南县","360700"));
				map.put("360730",new Area("360730","宁都县","360700"));
				map.put("360731",new Area("360731","于都县","360700"));
				map.put("360732",new Area("360732","兴国县","360700"));
				map.put("360733",new Area("360733","会昌县","360700"));
				map.put("360734",new Area("360734","寻乌县","360700"));
				map.put("360735",new Area("360735","石城县","360700"));
				map.put("360751",new Area("360751","黄金区","360700"));
				map.put("360781",new Area("360781","瑞金市","360700"));
				map.put("360782",new Area("360782","南康市","360700"));
			
			
			map.put("360800",new Area("360800","吉安市","360000"));
				map.put("360802",new Area("360802","吉州区","360800"));
				map.put("360803",new Area("360803","青原区","360800"));
				map.put("360821",new Area("360821","吉安县","360800"));
				map.put("360822",new Area("360822","吉水县","360800"));
				map.put("360823",new Area("360823","峡江县","360800"));
				map.put("360824",new Area("360824","新干县","360800"));
				map.put("360825",new Area("360825","永丰县","360800"));
				map.put("360826",new Area("360826","泰和县","360800"));
				map.put("360827",new Area("360827","遂川县","360800"));
				map.put("360828",new Area("360828","万安县","360800"));
				map.put("360829",new Area("360829","安福县","360800"));
				map.put("360830",new Area("360830","永新县","360800"));
				map.put("360881",new Area("360881","井冈山市","360800"));
			
			
			map.put("360900",new Area("360900","宜春市","360000"));
				map.put("360902",new Area("360902","袁州区","360900"));
				map.put("360921",new Area("360921","奉新县","360900"));
				map.put("360922",new Area("360922","万载县","360900"));
				map.put("360923",new Area("360923","上高县","360900"));
				map.put("360924",new Area("360924","宜丰县","360900"));
				map.put("360925",new Area("360925","靖安县","360900"));
				map.put("360926",new Area("360926","铜鼓县","360900"));
				map.put("360981",new Area("360981","丰城市","360900"));
				map.put("360982",new Area("360982","樟树市","360900"));
				map.put("360983",new Area("360983","高安市","360900"));
			
			
			map.put("361000",new Area("361000","抚州市","360000"));
				map.put("361002",new Area("361002","临川区","361000"));
				map.put("361021",new Area("361021","南城县","361000"));
				map.put("361022",new Area("361022","黎川县","361000"));
				map.put("361023",new Area("361023","南丰县","361000"));
				map.put("361024",new Area("361024","崇仁县","361000"));
				map.put("361025",new Area("361025","乐安县","361000"));
				map.put("361026",new Area("361026","宜黄县","361000"));
				map.put("361027",new Area("361027","金溪县","361000"));
				map.put("361028",new Area("361028","资溪县","361000"));
				map.put("361029",new Area("361029","东乡县","361000"));
				map.put("361030",new Area("361030","广昌县","361000"));
			
			
			map.put("361100",new Area("361100","上饶市","360000"));
				map.put("361102",new Area("361102","信州区","361100"));
				map.put("361121",new Area("361121","上饶县","361100"));
				map.put("361122",new Area("361122","广丰县","361100"));
				map.put("361123",new Area("361123","玉山县","361100"));
				map.put("361124",new Area("361124","铅山县","361100"));
				map.put("361125",new Area("361125","横峰县","361100"));
				map.put("361126",new Area("361126","弋阳县","361100"));
				map.put("361127",new Area("361127","余干县","361100"));
				map.put("361128",new Area("361128","鄱阳县","361100"));
				map.put("361129",new Area("361129","万年县","361100"));
				map.put("361130",new Area("361130","婺源县","361100"));
				map.put("361181",new Area("361181","德兴市","361100"));
		
		/*
		 * 山东省
		 */
		map.put("370000",new Area("370000","山东省","0"));
			map.put("370100",new Area("370100","济南市","370000"));
				map.put("370102",new Area("370102","历下区","370100"));
				map.put("370103",new Area("370103","市中区","370100"));
				map.put("370104",new Area("370104","槐荫区","370100"));
				map.put("370105",new Area("370105","天桥区","370100"));
				map.put("370112",new Area("370112","历城区","370100"));
				map.put("370113",new Area("370113","长清区","370100"));
				map.put("370124",new Area("370124","平阴县","370100"));
				map.put("370125",new Area("370125","济阳县","370100"));
				map.put("370126",new Area("370126","商河县","370100"));
				map.put("370181",new Area("370181","章丘市","370100"));
			
			
			map.put("370200",new Area("370200","青岛市","370000"));
				map.put("370202",new Area("370202","市南区","370200"));
				map.put("370203",new Area("370203","市北区","370200"));
				map.put("370205",new Area("370205","四方区","370200"));
				map.put("370211",new Area("370211","黄岛区","370200"));
				map.put("370212",new Area("370212","崂山区","370200"));
				map.put("370213",new Area("370213","李沧区","370200"));
				map.put("370214",new Area("370214","城阳区","370200"));
				map.put("370251",new Area("370251","开发区","370200"));
				map.put("370281",new Area("370281","胶州市","370200"));
				map.put("370282",new Area("370282","即墨市","370200"));
				map.put("370283",new Area("370283","平度市","370200"));
				map.put("370284",new Area("370284","胶南市","370200"));
				map.put("370285",new Area("370285","莱西市","370200"));
			
			
			map.put("370300",new Area("370300","淄博市","370000"));
				map.put("370302",new Area("370302","淄川区","370300"));
				map.put("370303",new Area("370303","张店区","370300"));
				map.put("370304",new Area("370304","博山区","370300"));
				map.put("370305",new Area("370305","临淄区","370300"));
				map.put("370306",new Area("370306","周村区","370300"));
				map.put("370321",new Area("370321","桓台县","370300"));
				map.put("370322",new Area("370322","高青县","370300"));
				map.put("370323",new Area("370323","沂源县","370300"));
			
			
			map.put("370400",new Area("370400","枣庄市","370000"));
				map.put("370402",new Area("370402","市中区","370400"));
				map.put("370403",new Area("370403","薛城区","370400"));
				map.put("370404",new Area("370404","峄城区","370400"));
				map.put("370405",new Area("370405","台儿庄区","370400"));
				map.put("370406",new Area("370406","山亭区","370400"));
				map.put("370481",new Area("370481","滕州市","370400"));
			
			
			map.put("370500",new Area("370500","东营市","370000"));
				map.put("370502",new Area("370502","东营区","370500"));
				map.put("370503",new Area("370503","河口区","370500"));
				map.put("370521",new Area("370521","垦利县","370500"));
				map.put("370522",new Area("370522","利津县","370500"));
				map.put("370523",new Area("370523","广饶县","370500"));
				map.put("370589",new Area("370589","西城区","370500"));
				map.put("370590",new Area("370590","东城区","370500"));
			
			
			map.put("370600",new Area("370600","烟台市","370000"));
				map.put("370602",new Area("370602","芝罘区","370600"));
				map.put("370611",new Area("370611","福山区","370600"));
				map.put("370612",new Area("370612","牟平区","370600"));
				map.put("370613",new Area("370613","莱山区","370600"));
				map.put("370634",new Area("370634","长岛县","370600"));
				map.put("370681",new Area("370681","龙口市","370600"));
				map.put("370682",new Area("370682","莱阳市","370600"));
				map.put("370683",new Area("370683","莱州市","370600"));
				map.put("370684",new Area("370684","蓬莱市","370600"));
				map.put("370685",new Area("370685","招远市","370600"));
				map.put("370686",new Area("370686","栖霞市","370600"));
				map.put("370687",new Area("370686","海阳市","370600"));
			
			
			map.put("370700",new Area("370700","潍坊市","370000"));
				map.put("370702",new Area("370702","潍城区","370700"));
				map.put("370703",new Area("370703","寒亭区","370700"));
				map.put("370704",new Area("370704","坊子区","370700"));
				map.put("370705",new Area("370705","奎文区","370700"));
				map.put("370724",new Area("370724","临朐县","370700"));
				map.put("370725",new Area("370725","昌乐县","370700"));
				map.put("370751",new Area("370751","开发区","370700"));
				map.put("370781",new Area("370781","青州市","370700"));
				map.put("370782",new Area("370782","诸城市","370700"));
				map.put("370783",new Area("370783","寿光市","370700"));
				map.put("370784",new Area("370784","安丘市","370700"));
				map.put("370785",new Area("370785","高密市","370700"));
				map.put("370706",new Area("370786","昌邑市","370700"));
			
			
			map.put("370800",new Area("370800","济宁市","370000"));
				map.put("370802",new Area("370802","市中区","370800"));
				map.put("370811",new Area("370811","任城区","370800"));
				map.put("370826",new Area("370826","微山县","370800"));
				map.put("370827",new Area("370827","鱼台县","370800"));
				map.put("370828",new Area("370828","金乡县","370800"));
				map.put("370829",new Area("370829","嘉祥县","370800"));
				map.put("370830",new Area("370830","汶上县","370800"));
				map.put("370831",new Area("370831","泗水县","370800"));
				map.put("370832",new Area("370832","梁山县","370800"));
				map.put("370881",new Area("370881","曲阜市","370800"));
				map.put("370882",new Area("370882","兖州市","370800"));
				map.put("370883",new Area("370883","邹城市","370800"));
			
			
			map.put("370900",new Area("370900","泰安市","370000"));
				map.put("370902",new Area("370902","泰山区","370900"));
				map.put("370903",new Area("370903","岱岳区","370900"));
				map.put("370921",new Area("370921","宁阳县","370900"));
				map.put("370923",new Area("370923","东平县","370900"));
				map.put("370982",new Area("370982","新泰市","370900"));
				map.put("370983",new Area("370983","肥城市","370900"));
			
			
			map.put("371000",new Area("371000","威海市","370000"));
				map.put("371002",new Area("371002","环翠区","371000"));
				map.put("371081",new Area("371081","文登市","371000"));
				map.put("371082",new Area("371082","荣成市","371000"));
				map.put("371083",new Area("371083","乳山市","371000"));
			
			
			map.put("371100",new Area("371100","日照市","370000"));
				map.put("371102",new Area("371102","东港区","371100"));
				map.put("371103",new Area("371103","岚山区","371100"));
				map.put("371121",new Area("371121","五莲县","371100"));
				map.put("371122",new Area("371122","莒县","371100"));
			
			
			map.put("371200",new Area("371200","莱芜市","370000"));
				map.put("371202",new Area("371202","莱城区","371200"));
				map.put("371203",new Area("371203","钢城区","371200"));
			
			
			map.put("371300",new Area("371300","临沂市","370000"));
				map.put("371302",new Area("371302","兰山区","371300"));
				map.put("371311",new Area("371311","罗庄区","371300"));
				map.put("371312",new Area("371312","河东区","371300"));
				map.put("371321",new Area("371321","沂南县","371300"));
				map.put("371322",new Area("371322","郯城县","371300"));
				map.put("371323",new Area("371323","沂水县","371300"));
				map.put("371324",new Area("371324","苍山县","371300"));
				map.put("371325",new Area("371325","费县","371300"));
				map.put("371326",new Area("371326","平邑县","371300"));
				map.put("371327",new Area("371327","莒南县","371300"));
				map.put("371328",new Area("371328","蒙阴县","371300"));
				map.put("371329",new Area("371329","临沭县","371300"));
			
			
			map.put("371400",new Area("371400","德州市","370000"));
				map.put("371402",new Area("371402","德城区","371400"));
				map.put("371421",new Area("371421","陵县","371400"));
				map.put("371422",new Area("371422","宁津县","371400"));
				map.put("371423",new Area("371423","庆云县","371400"));
				map.put("371424",new Area("371424","临邑县","371400"));
				map.put("371425",new Area("371425","齐河县","371400"));
				map.put("371426",new Area("371426","平原县","371400"));
				map.put("371427",new Area("371427","夏津县","371400"));
				map.put("371428",new Area("371428","武城县","371400"));
				map.put("371451",new Area("371451","开发区","371400"));
				map.put("371481",new Area("371481","乐陵市","371400"));
				map.put("371482",new Area("371482","禹城市","371400"));
			
			
			map.put("371500",new Area("371500","聊城市","370000"));
				map.put("371502",new Area("371502","东昌府区","371500"));
				map.put("371521",new Area("371521","阳谷县","371500"));
				map.put("371522",new Area("371522","莘县","371500"));
				map.put("371523",new Area("371523","茌平县","371500"));
				map.put("371524",new Area("371524","东阿县","371500"));
				map.put("371525",new Area("371525","冠县","371500"));
				map.put("371526",new Area("371526","高唐县","371500"));
				map.put("371581",new Area("371581","临清市","371500"));
			
			
			map.put("371600",new Area("371600","滨州市","370000"));
				map.put("371602",new Area("371602","滨城区","371600"));
				map.put("371621",new Area("371621","惠民县","371600"));
				map.put("371622",new Area("371622","阳信县","371600"));
				map.put("371623",new Area("371623","无棣县","371600"));
				map.put("371624",new Area("371624","沾化县","371600"));
				map.put("371625",new Area("371625","博兴县","371600"));
				map.put("371626",new Area("371626","邹平县","371600"));
			
			
			map.put("371700",new Area("371700","荷泽市","370000"));
				map.put("371702",new Area("371702","牡丹区","371700"));
				map.put("371721",new Area("371721","曹县","371700"));
				map.put("371722",new Area("371722","单县","371700"));
				map.put("371723",new Area("371723","成武县","371700"));
				map.put("371724",new Area("371724","巨野县","371700"));
				map.put("371725",new Area("371725","郓城县","371700"));
				map.put("371726",new Area("371726","鄄城县","371700"));
				map.put("371727",new Area("371727","定陶县","371700"));
				map.put("371728",new Area("371728","东明县","371700"));
			
		method1(map);
//			map.put("632900",new Area("632900","青海省油田教育管理中心","630000"));
		return map;
	}

	private static void method1(Map<String, Area> map) {
		/*
		 * 河南省
		 */
		map.put("410000",new Area("410000","河南省","0"));
			map.put("410100",new Area("410100","郑州市","410000"));
				map.put("410102",new Area("410102","中原区","410100"));
				map.put("410103",new Area("410103","二七区","410100"));
				map.put("410104",new Area("410104","管城回族区","410100"));
				map.put("410105",new Area("410105","金水区","410100"));
				map.put("410106",new Area("410106","上街区","410100"));
				map.put("410108",new Area("410108","惠济区","410100"));
				map.put("410122",new Area("410122","中牟县","410100"));
				map.put("410181",new Area("410181","巩义市","410100"));
				map.put("410182",new Area("410182","荥阳市","410100"));
				map.put("410183",new Area("410183","新密市","410100"));
				map.put("410184",new Area("410184","新郑市","410100"));
				map.put("410185",new Area("410185","登封市","410100"));
				map.put("410186",new Area("410186","郑东新区","410100"));
				map.put("410187",new Area("410187","高新区","410100"));
				
				
			map.put("410200",new Area("410200","开封市","410000"));
				map.put("410202",new Area("410202","龙亭区","410200"));
				map.put("410203",new Area("410203","顺河回族区","410200"));
				map.put("410204",new Area("410204","鼓楼区","410200"));
				map.put("410205",new Area("410205","禹王台区","410200"));
				map.put("410211",new Area("410211","金明区","410200"));
				map.put("410221",new Area("410221","杞县","410200"));
				map.put("410222",new Area("410222","通许县","410200"));
				map.put("410223",new Area("410223","尉氏县","410200"));
				map.put("410224",new Area("410224","开封县","410200"));
				map.put("410225",new Area("410225","兰考县","410200"));
			
			
			map.put("410300",new Area("410300","洛阳市","410000"));
				map.put("410302",new Area("410302","老城区","410300"));
				map.put("410303",new Area("410303","西工区","410300"));
				map.put("410304",new Area("410304","廛河回族区","410300"));
				map.put("410305",new Area("410305","涧西区","410300"));
				map.put("410306",new Area("410306","吉利区","410300"));
				map.put("410307",new Area("410307","洛龙区","410300"));
				map.put("410322",new Area("410322","孟津县","410300"));
				map.put("410323",new Area("410323","新安县","410300"));
				map.put("410324",new Area("410324","栾川县","410300"));
				map.put("410325",new Area("410325","嵩县","410300"));
				map.put("410326",new Area("410326","汝阳县","410300"));
				map.put("410327",new Area("410327","宜阳县","410300"));
				map.put("410328",new Area("410328","洛宁县","410300"));
				map.put("410329",new Area("410329","伊川县","410300"));
				map.put("410381",new Area("410381","偃师市","410300"));
				map.put("410004",new Area("410004","高新区","410300"));
			
			
			map.put("410400",new Area("410400","平顶山市","410000"));
				map.put("410402",new Area("410402","新华区","410400"));
				map.put("410403",new Area("410403","卫东区","410400"));
				map.put("410404",new Area("410404","石龙区","410400"));
				map.put("410411",new Area("410411","湛河区","410400"));
				map.put("410421",new Area("410421","宝丰县","410400"));
				map.put("410422",new Area("410422","叶县","410400"));
				map.put("410423",new Area("410423","鲁山县","410400"));
				map.put("410425",new Area("410425","郏县","410400"));
				map.put("410481",new Area("410481","舞钢市","410400"));
				map.put("410482",new Area("410482","汝州市","410400"));
			
			
			map.put("410500",new Area("410500","安阳市","410000"));
				map.put("410502",new Area("410502","文峰区","410500"));
				map.put("410503",new Area("410503","北关区","410500"));
				map.put("410505",new Area("410505","殷都区","410500"));
				map.put("410506",new Area("410506","龙安区","410500"));
				map.put("410522",new Area("410522","安阳县","410500"));
				map.put("410523",new Area("410523","汤阴县","410500"));
				map.put("410526",new Area("410526","滑县","410500"));
				map.put("410527",new Area("410527","内黄县","410500"));
				map.put("410581",new Area("410581","林州市","410500"));
			
			
			map.put("410600",new Area("410600","鹤壁市","410000"));
				map.put("410602",new Area("410602","鹤山区","410600"));
				map.put("410603",new Area("410603","山城区","410600"));
				map.put("410611",new Area("410611","淇滨区","410600"));
				map.put("410621",new Area("410621","浚县","410600"));
				map.put("410622",new Area("410622","淇县","410600"));
			
			
			map.put("410700",new Area("410700","新乡市","410000"));
				map.put("410702",new Area("410702","红旗区","410700"));
				map.put("410703",new Area("410703","卫滨区","410700"));
				map.put("410704",new Area("410704","凤泉区","410700"));
				map.put("410711",new Area("410711","牧野区","410700"));
				map.put("410721",new Area("410721","新乡县","410700"));
				map.put("410724",new Area("410724","获嘉县","410700"));
				map.put("410725",new Area("410725","原阳县","410700"));
				map.put("410726",new Area("410726","延津县","410700"));
				map.put("410727",new Area("410727","封丘县","410700"));
				map.put("410728",new Area("410728","长垣县","410700"));
				map.put("410781",new Area("410781","卫辉市","410700"));
				map.put("410782",new Area("410782","辉县市","410700"));
			
			
			map.put("410800",new Area("410800","焦作市","410000"));
				map.put("410802",new Area("410802","解放区","410800"));
				map.put("410803",new Area("410803","中站区","410800"));
				map.put("410804",new Area("410804","马村区","410800"));
				map.put("410811",new Area("410811","山阳区","410800"));
				map.put("410821",new Area("410821","修武县","410800"));
				map.put("410822",new Area("410822","博爱县","410800"));
				map.put("410823",new Area("410823","武陟县","410800"));
				map.put("410825",new Area("410825","温县","410800"));
				map.put("410882",new Area("410882","沁阳市","410800"));
				map.put("410883",new Area("410883","孟州市","410800"));
			
			map.put("410881",new Area("410881","济源市","410000"));//?为什么下面没有区域
				
			map.put("410900",new Area("410900","濮阳市","410000"));
				map.put("410902",new Area("410902","华龙区","410900"));
				map.put("410922",new Area("410922","清丰县","410900"));
				map.put("410923",new Area("410923","南乐县","410900"));
				map.put("410926",new Area("410926","范县","410900"));
				map.put("410927",new Area("410927","台前县","410900"));
				map.put("410928",new Area("410928","濮阳县","410900"));
			
			
			map.put("411000",new Area("411000","许昌市","410000"));
				map.put("411002",new Area("411002","魏都区","411000"));
				map.put("411003",new Area("411003","许昌县","411000"));
				map.put("411004",new Area("411004","鄢陵县","411000"));
				map.put("411005",new Area("411005","襄城县","411000"));
				map.put("411081",new Area("411081","禹州市","411000"));
				map.put("411082",new Area("411082","长葛市","411000"));
			
			
			map.put("411100",new Area("411100","漯河市","410000"));
				map.put("411102",new Area("411102","源汇区","411100"));
				map.put("411103",new Area("411103","郾城区","411100"));
				map.put("411104",new Area("411104","召陵区","411100"));
				map.put("411121",new Area("411121","舞阳县","411100"));
				map.put("411122",new Area("411122","临颍县","411100"));
			
			
			map.put("411200",new Area("411200","三门峡市","410000"));
				map.put("411202",new Area("411202","湖滨区","411200"));
				map.put("411221",new Area("411221","渑池县","411200"));
				map.put("411222",new Area("411222","陕县","411200"));
				map.put("411224",new Area("411224","卢氏县","411200"));
				map.put("411281",new Area("411281","义马市","411200"));
				map.put("411282",new Area("411282","灵宝市","411200"));
			
			
			map.put("411300",new Area("411300","南阳市","410000"));
				map.put("411302",new Area("411302","宛城区","411300"));
				map.put("411303",new Area("411303","卧龙区","411300"));
				map.put("411321",new Area("411321","南召县","411300"));
				map.put("411322",new Area("411322","方城县","411300"));
				map.put("411323",new Area("411323","西峡县","411300"));
				map.put("411324",new Area("411324","镇平县","411300"));
				map.put("411325",new Area("411325","内乡县","411300"));
				map.put("411326",new Area("411326","淅川县","411300"));
				map.put("411327",new Area("411327","社旗县","411300"));
				map.put("411328",new Area("411328","唐河县","411300"));
				map.put("411329",new Area("411329","新野县","411300"));
				map.put("411330",new Area("411330","桐柏县","411300"));
				map.put("411381",new Area("411381","邓州市","411300"));
			
			
			map.put("411400",new Area("411400","商丘市","410000"));
				map.put("411402",new Area("411402","梁园区","411400"));
				map.put("411403",new Area("411403","睢阳区","411400"));
				map.put("411421",new Area("411421","民权县","411400"));
				map.put("411422",new Area("411422","睢县","411400"));
				map.put("411423",new Area("411423","宁陵县","411400"));
				map.put("411424",new Area("411424","柘城县","411400"));
				map.put("411425",new Area("411425","虞城县","411400"));
				map.put("411426",new Area("411426","夏邑县","411400"));
				map.put("411481",new Area("411481","永城市","411400"));
			
			
			map.put("411500",new Area("411500","信阳市","410000"));
				map.put("411502",new Area("411502","浉河区","411500"));
				map.put("411503",new Area("411503","平桥区","411500"));
				map.put("411521",new Area("411521","罗山县","411500"));
				map.put("411522",new Area("411522","光山县","411500"));
				map.put("411523",new Area("411523","新县","411500"));
				map.put("411524",new Area("411524","商城县","411500"));
				map.put("411525",new Area("411525","固始县","411500"));
				map.put("411526",new Area("411526","潢川县","411500"));
				map.put("411527",new Area("411527","淮滨县","411500"));
				map.put("411528",new Area("411528","息县","411500"));
			
			
			map.put("411600",new Area("411600","周口市","410000"));
				map.put("411602",new Area("411602","川汇区","411600"));
				map.put("411621",new Area("411621","扶沟县","411600"));
				map.put("411622",new Area("411622","西华县","411600"));
				map.put("411623",new Area("411623","商水县","411600"));
				map.put("411624",new Area("411624","沈丘县","411600"));
				map.put("411625",new Area("411625","郸城县","411600"));
				map.put("411626",new Area("411626","淮阳县","411600"));
				map.put("411627",new Area("411627","太康县","411600"));
				map.put("411628",new Area("411628","鹿邑县","411600"));
				map.put("411681",new Area("411681","项城市","411600"));
			
			
			map.put("411700",new Area("411700","驻马店市","410000"));
				map.put("411702",new Area("411702","驿城区","411700"));
				map.put("411721",new Area("411721","西平县","411700"));
				map.put("411722",new Area("411722","上蔡县","411700"));
				map.put("411723",new Area("411723","平舆县","411700"));
				map.put("411724",new Area("411724","正阳县","411700"));
				map.put("411725",new Area("411725","确山县","411700"));
				map.put("411726",new Area("411726","泌阳县","411700"));
				map.put("411727",new Area("411727","汝南县","411700"));
				map.put("411728",new Area("411728","遂平县","411700"));
				map.put("411729",new Area("411729","新蔡县","411700"));
			
		/*
		 * 湖北省
		 */
		map.put("420000",new Area("420000","湖北省","0"));
			map.put("420100",new Area("420100","武汉市","420000"));
				map.put("420102",new Area("420102","江岸区","420100"));
				map.put("420103",new Area("420103","江汉区","420100"));
				map.put("420104",new Area("420104","硚口区","420100"));
				map.put("420105",new Area("420105","汉阳区","420100"));
				map.put("420106",new Area("420106","武昌区","420100"));
				map.put("420107",new Area("420107","青山区","420100"));
				map.put("420111",new Area("420111","洪山区","420100"));
				map.put("420112",new Area("420112","东西湖区","420100"));
				map.put("420113",new Area("420113","汉南区","420100"));
				map.put("420114",new Area("420114","蔡甸区","420100"));
				map.put("420115",new Area("420115","江夏区","420100"));
				map.put("420116",new Area("420116","黄陂区","420100"));
				map.put("420117",new Area("420117","新洲区","420100"));
			
			
			map.put("420200",new Area("420200","黄石市","420000"));
				map.put("420202",new Area("420202","黄石港区","420200"));
				map.put("420203",new Area("420203","西塞山区","420200"));
				map.put("420204",new Area("420204","下陆区","420200"));
				map.put("420205",new Area("420205","铁山区","420200"));
				map.put("420222",new Area("420222","阳新县","420200"));
				map.put("420281",new Area("420281","大冶市","420200"));
			
			
			map.put("420300",new Area("420300","十堰市","420000"));
				map.put("420302",new Area("420302","茅箭区","420300"));
				map.put("420303",new Area("420303","张湾区","420300"));
				map.put("420321",new Area("420321","郧县","420300"));
				map.put("420322",new Area("420322","郧西县","420300"));
				map.put("420323",new Area("420323","竹山县","420300"));
				map.put("420324",new Area("420324","竹溪县","420300"));
				map.put("420325",new Area("420325","房县","420300"));
				map.put("420381",new Area("420381","丹江口市","420300"));
				map.put("420382",new Area("420382","城区","420300"));
			
			
			map.put("420500",new Area("420500","宜昌市","420000"));
				map.put("420502",new Area("420502","西陵区","420500"));
				map.put("420503",new Area("420503","伍家岗区","420500"));
				map.put("420504",new Area("420504","点军区","420500"));
				map.put("420505",new Area("420505","猇亭区","420500"));
				map.put("420506",new Area("420506","夷陵区","420500"));
				map.put("420525",new Area("420525","远安县","420500"));
				map.put("420526",new Area("420526","兴山县","420500"));
				map.put("420527",new Area("420527","秭归县","420500"));
				map.put("420528",new Area("420528","长阳土家族自治县","420500"));
				map.put("420529",new Area("420529","五峰土家族自治县","420500"));
				map.put("420551",new Area("420551","葛洲坝区","420500"));
				map.put("420552",new Area("420552","开发区","420500"));
				map.put("420581",new Area("420581","宜都市","420500"));
				map.put("420582",new Area("420582","当阳市","420500"));
				map.put("420583",new Area("420583","枝江市","420500"));
			
			
			map.put("420600",new Area("420600","襄阳市","420000"));
				map.put("420602",new Area("420602","襄城区","420600"));
				map.put("420606",new Area("420606","樊城区","420600"));
				map.put("420607",new Area("420607","襄州区","420600"));
				map.put("420624",new Area("420624","南漳县","420600"));
				map.put("420625",new Area("420625","谷城县","420600"));
				map.put("420626",new Area("420626","保康县","420600"));
				map.put("420682",new Area("420682","老河口市","420600"));
				map.put("420683",new Area("420683","枣阳市","420600"));
				map.put("420684",new Area("420684","宜城市","420600"));
			
			
			map.put("420700",new Area("420700","鄂州市","420000"));
				map.put("420702",new Area("420702","梁子湖区","420700"));
				map.put("420703",new Area("420703","华容区","420700"));
				map.put("420704",new Area("420704","鄂城区","420700"));
				
			
			map.put("420800",new Area("420800","荆门市","420000"));
				map.put("420802",new Area("420802","东宝区","420800"));
				map.put("420804",new Area("420804","掇刀区","420800"));
				map.put("420821",new Area("420821","京山县","420800"));
				map.put("420822",new Area("420822","沙洋县","420800"));
				map.put("420881",new Area("420881","钟祥市","420800"));
			
			
			map.put("420900",new Area("420900","孝感市","420000"));
				map.put("420902",new Area("420902","孝南区","420900"));
				map.put("420921",new Area("420921","孝昌县","420900"));
				map.put("420922",new Area("420922","大悟县","420900"));
				map.put("420923",new Area("420923","云梦县","420900"));
				map.put("420981",new Area("420981","应城市","420900"));
				map.put("420982",new Area("420982","安陆市","420900"));
				map.put("420984",new Area("420984","汉川市","420900"));
			
			
			map.put("421000",new Area("421000","荆州市","420000"));
				map.put("421002",new Area("421002","沙市区","421000"));
				map.put("421003",new Area("421003","荆州区","421000"));
				map.put("421022",new Area("421022","公安县","421000"));
				map.put("421023",new Area("421023","监利县","421000"));
				map.put("421024",new Area("421024","江陵县","421000"));
				map.put("421081",new Area("421081","石首市","421000"));
				map.put("421083",new Area("421083","洪湖市","421000"));
				map.put("421087",new Area("421087","松滋市","421000"));
			
			
			map.put("421100",new Area("421100","黄冈市","420000"));
				map.put("421102",new Area("421102","黄州区","421100"));
				map.put("421121",new Area("421121","团风县","421100"));
				map.put("421122",new Area("421122","红安县","421100"));
				map.put("421123",new Area("421123","罗田县","421100"));
				map.put("421124",new Area("421124","英山县","421100"));
				map.put("421125",new Area("421125","浠水县","421100"));
				map.put("421126",new Area("421126","蕲春县","421100"));
				map.put("421127",new Area("421127","黄梅县","421100"));
				map.put("421181",new Area("421181","麻城市","421100"));
				map.put("421182",new Area("421182","武穴市","421100"));
			
			
			map.put("421200",new Area("421200","咸宁市","420000"));
				map.put("421202",new Area("421202","咸安区","421200"));
				map.put("421221",new Area("421221","嘉鱼县","421200"));
				map.put("421222",new Area("421222","通城县","421200"));
				map.put("421223",new Area("421223","崇阳县","421200"));
				map.put("421224",new Area("421224","通山县","421200"));
				map.put("421281",new Area("421281","赤壁市","421200"));
				map.put("421282",new Area("421282","温泉城区","421200"));
			
			
			map.put("421300",new Area("421300","随州市","420000"));
				map.put("421302",new Area("421302","曾都区","421300"));
				map.put("421321",new Area("421321","随县","421300"));
				map.put("421381",new Area("421381","广水市","421300"));
			
			
			map.put("422800",new Area("422800","恩施土家族苗族自治州","420000"));
				map.put("422801",new Area("422801","恩施市","422800"));
				map.put("422802",new Area("422802","利川市","422800"));
				map.put("422822",new Area("422822","建始县","422800"));
				map.put("422823",new Area("422823","巴东县","422800"));
				map.put("422825",new Area("422825","宣恩县","422800"));
				map.put("422826",new Area("422826","咸丰县","422800"));
				map.put("422827",new Area("422827","来凤县","422800"));
				map.put("422828",new Area("422828","鹤峰县","422800"));
			
			
			map.put("429004",new Area("429004","仙桃市","420000"));
			map.put("429005",new Area("429005","潜江市","420000"));
			map.put("429006",new Area("429006","天门市","420000"));
			map.put("429021",new Area("429021","神农架林区","420000"));
		
		/*
		 * 湖南省
		 */
		map.put("430000",new Area("430000","湖南省","0"));
			map.put("430100",new Area("430100","长沙市","430000"));
				map.put("430102",new Area("430102","芙蓉区","430100"));
				map.put("430103",new Area("430103","天心区","430100"));
				map.put("430104",new Area("430104","岳麓区","430100"));
				map.put("430105",new Area("430105","开福区","430100"));
				map.put("430111",new Area("430111","雨花区","430100"));
				map.put("430121",new Area("430121","长沙县","430100"));
				map.put("430122",new Area("430122","望城县","430100"));
				map.put("430124",new Area("430124","宁乡县","430100"));
				map.put("430181",new Area("430181","浏阳市","430100"));
			
			
			map.put("430200",new Area("430200","株洲市","430000"));
				map.put("430202",new Area("430202","荷塘区","430200"));
				map.put("430203",new Area("430203","芦淞区","430200"));
				map.put("430204",new Area("430204","石峰区","430200"));
				map.put("430211",new Area("430211","天元区","430200"));
				map.put("430221",new Area("430221","株洲县","430200"));
				map.put("430223",new Area("430223","攸县","430200"));
				map.put("430224",new Area("430224","茶陵县","430200"));
				map.put("430225",new Area("430225","炎陵县","430200"));
				map.put("430281",new Area("430281","醴陵市","430200"));
			
			
			map.put("430300",new Area("430300","湘潭市","430000"));
				map.put("430302",new Area("430302","雨湖区","430300"));
				map.put("430304",new Area("430304","岳塘区","430300"));
				map.put("430321",new Area("430321","湘潭县","430300"));
				map.put("430381",new Area("430381","湘乡市","430300"));
				map.put("430382",new Area("430382","韶山市","430300"));
			
			
			map.put("430400",new Area("430400","衡阳市","430000"));
				map.put("430405",new Area("430405","珠晖区","430400"));
				map.put("430406",new Area("430406","雁峰区","430400"));
				map.put("430407",new Area("430407","石鼓区","430400"));
				map.put("430408",new Area("430408","蒸湘区","430400"));
				map.put("430412",new Area("430412","南岳区","430400"));
				map.put("430421",new Area("430421","衡阳县","430400"));
				map.put("430422",new Area("430422","衡南县","430400"));
				map.put("430423",new Area("430423","衡山县","430400"));
				map.put("430424",new Area("430424","衡东县","430400"));
				map.put("430426",new Area("430426","祁东县","430400"));
				map.put("430481",new Area("430481","耒阳市","430400"));
				map.put("430482",new Area("430482","常宁市","430400"));
			
			
			map.put("430500",new Area("430500","邵阳市","430000"));
				map.put("430502",new Area("430502","双清区","430500"));
				map.put("430503",new Area("430503","大祥区","430500"));
				map.put("430511",new Area("430511","北塔区","430500"));
				map.put("430521",new Area("430521","邵东县","430500"));
				map.put("430522",new Area("430522","新邵县","430500"));
				map.put("430523",new Area("430523","邵阳县","430500"));
				map.put("430524",new Area("430524","隆回县","430500"));
				map.put("430525",new Area("430525","洞口县","430500"));
				map.put("430527",new Area("430527","绥宁县","430500"));
				map.put("430528",new Area("430528","新宁县","430500"));
				map.put("430529",new Area("430529","城步苗族自治县","430500"));
				map.put("430581",new Area("430581","武冈市","430500"));
			
			
			map.put("430600",new Area("430600","岳阳市","430000"));
				map.put("430602",new Area("430602","岳阳楼区","430600"));
				map.put("430603",new Area("430603","云溪区","430600"));
				map.put("430611",new Area("430611","君山区","430600"));
				map.put("430621",new Area("430621","岳阳县","430600"));
				map.put("430623",new Area("430623","华容县","430600"));
				map.put("430624",new Area("430624","湘阴县","430600"));
				map.put("430626",new Area("430626","平江县","430600"));
				map.put("430681",new Area("430681","汨罗市","430600"));
				map.put("430682",new Area("430682","临湘市","430600"));
			
			
			map.put("430700",new Area("430700","常德市","430000"));
				map.put("430702",new Area("430702","武陵区","430700"));
				map.put("430703",new Area("430703","鼎城区","430700"));
				map.put("430721",new Area("430721","安乡县","430700"));
				map.put("430722",new Area("430722","汉寿县","430700"));
				map.put("430723",new Area("430723","澧县","430700"));
				map.put("430724",new Area("430724","临澧县","430700"));
				map.put("430725",new Area("430725","桃源县","430700"));
				map.put("430726",new Area("430726","石门县","430700"));
				map.put("430781",new Area("430781","津市市","430700"));
			
			
			map.put("430800",new Area("430800","张家界市","430000"));
				map.put("430802",new Area("430802","永定区","430800"));
				map.put("430811",new Area("430811","武陵源区","430800"));
				map.put("430821",new Area("430821","慈利县","430800"));
				map.put("430822",new Area("430822","桑植县","430800"));
			
			
			map.put("430900",new Area("430900","益阳市","430000"));
				map.put("430902",new Area("430902","资阳区","430900"));
				map.put("430903",new Area("430903","赫山区","430900"));
				map.put("430921",new Area("430921","南县","430900"));
				map.put("430922",new Area("430922","桃江县","430900"));
				map.put("430923",new Area("430923","安化县","430900"));
				map.put("430981",new Area("430981","沅江市","430900"));
			
			
			map.put("431000",new Area("431000","郴州市","430000"));
				map.put("431002",new Area("431002","北湖区","431000"));
				map.put("431003",new Area("431003","苏仙区","431000"));
				map.put("431021",new Area("431021","桂阳县","431000"));
				map.put("431022",new Area("431022","宜章县","431000"));
				map.put("431023",new Area("431023","永兴县","431000"));
				map.put("431024",new Area("431024","嘉禾县","431000"));
				map.put("431025",new Area("431025","临武县","431000"));
				map.put("431026",new Area("431026","汝城县","431000"));
				map.put("431027",new Area("431027","桂东县","431000"));
				map.put("431028",new Area("431028","安仁县","431000"));
				map.put("431081",new Area("431081","资兴市","431000"));
			
			
			map.put("431100",new Area("431100","永州市","430000"));
				map.put("431102",new Area("431102","零陵区","431100"));
				map.put("431103",new Area("431103","冷水滩区","431100"));
				map.put("431121",new Area("431121","祁阳县","431100"));
				map.put("431122",new Area("431122","东安县","431100"));
				map.put("431123",new Area("431123","双牌县","431100"));
				map.put("431124",new Area("431124","道县","431100"));
				map.put("431125",new Area("431125","江永县","431100"));
				map.put("431126",new Area("431126","宁远县","431100"));
				map.put("431127",new Area("431127","蓝山县","431100"));
				map.put("431128",new Area("431128","新田县","431100"));
				map.put("431129",new Area("431129","江华瑶族自治县","431100"));
			
			
			map.put("431200",new Area("431200","怀化市","430000"));
				map.put("431202",new Area("431202","鹤城区","431200"));
				map.put("431221",new Area("431221","中方县","431200"));
				map.put("431222",new Area("431222","沅陵县","431200"));
				map.put("431223",new Area("431223","辰溪县","431200"));
				map.put("431224",new Area("431224","溆浦县","431200"));
				map.put("431225",new Area("431225","会同县","431200"));
				map.put("431226",new Area("431226","麻阳苗族自治县","431200"));
				map.put("431227",new Area("431227","新晃侗族自治县","431200"));
				map.put("431228",new Area("431228","芷江侗族自治县","431200"));
				map.put("431229",new Area("431229","靖州苗族侗族自治县","431200"));
				map.put("431230",new Area("431230","通道侗族自治县","431200"));
				map.put("431281",new Area("431281","洪江市","431200"));
			
			
			map.put("431300",new Area("431300","娄底市","430000"));
				map.put("431302",new Area("431302","娄星区","431300"));
				map.put("431321",new Area("431321","双峰县","431300"));
				map.put("431322",new Area("431322","新化县","431300"));
				map.put("431381",new Area("431381","冷水江市","431300"));
				map.put("431382",new Area("431382","涟源市","431300"));
			
			
			map.put("433100",new Area("433100","湘西土家族苗族自治州","430000"));
				map.put("433101",new Area("433101","吉首市","433100"));
				map.put("433122",new Area("433122","泸溪县","433100"));
				map.put("433123",new Area("433123","凤凰县","433100"));
				map.put("433124",new Area("433124","花垣县","433100"));
				map.put("433125",new Area("433125","保靖县","433100"));
				map.put("433126",new Area("433126","古丈县","433100"));
				map.put("433127",new Area("433127","永顺县","433100"));
				map.put("433130",new Area("433130","龙山县","433100"));
		
			
		/*
		 * 广东省
		 */
		map.put("440000",new Area("440000","广东省","0"));
			map.put("440100",new Area("440100","广州市","440000"));
				map.put("440103",new Area("440103","荔湾区","440100"));
				map.put("440104",new Area("440104","越秀区","440100"));
				map.put("440105",new Area("440105","海珠区","440100"));
				map.put("440106",new Area("440106","天河区","440100"));
				map.put("440111",new Area("440111","白云区","440100"));
				map.put("440112",new Area("440112","黄埔区","440100"));
				map.put("440113",new Area("440113","番禺区","440100"));
				map.put("440114",new Area("440114","花都区","440100"));
				map.put("440115",new Area("440115","南沙区","440100"));
				map.put("440116",new Area("440116","萝岗区","440100"));
				map.put("440183",new Area("440183","增城市","440100"));
				map.put("440184",new Area("440184","从化市","440100"));
				map.put("440188",new Area("440188","东山区","440100"));
			
			
			map.put("440200",new Area("440200","韶关市","440000"));
				map.put("440203",new Area("440203","武江区","440200"));
				map.put("440204",new Area("440204","浈江区","440200"));
				map.put("440205",new Area("440205","曲江区","440200"));
				map.put("440222",new Area("440222","始兴县","440200"));
				map.put("440224",new Area("440224","仁化县","440200"));
				map.put("440229",new Area("440229","翁源县","440200"));
				map.put("440232",new Area("440232","乳源瑶族自治县","440200"));
				map.put("440233",new Area("440233","新丰县","440200"));
				map.put("440281",new Area("440281","乐昌市","440200"));
				map.put("440282",new Area("440282","南雄市","440200"));
			
			
			map.put("440300",new Area("440300","深圳市","440000"));
				map.put("440303",new Area("440303","罗湖区","440300"));
				map.put("440304",new Area("440304","福田区","440300"));
				map.put("440305",new Area("440305","南山区","440300"));
				map.put("440306",new Area("440306","宝安区","440300"));
				map.put("440307",new Area("440307","龙岗区","440300"));
				map.put("440308",new Area("440308","盐田区","440300"));
				map.put("440320",new Area("440320","光明新区","440300"));
				map.put("440321",new Area("440321","坪山新区","440300"));
				map.put("440322",new Area("440322","大鹏新区","440300"));
				map.put("440323",new Area("440323","龙华新区","440300"));
			
			
			map.put("440400",new Area("440400","珠海市","440000"));
				map.put("440402",new Area("440402","香洲区","440400"));
				map.put("440403",new Area("440403","斗门区","440400"));
				map.put("440404",new Area("440404","金湾区","440400"));
				map.put("440486",new Area("440486","金唐区","440400"));
				map.put("440487",new Area("440487","南湾区","440400"));
			
			
			map.put("440500",new Area("440500","汕头市","440000"));
				map.put("440507",new Area("440507","龙湖区","440500"));
				map.put("440511",new Area("440511","金平区","440500"));
				map.put("440512",new Area("440512","濠江区","440500"));
				map.put("440513",new Area("440513","潮阳区","440500"));
				map.put("440514",new Area("440514","潮南区","440500"));
				map.put("440515",new Area("440515","澄海区","440500"));
				map.put("440523",new Area("440523","南澳县","440500"));
			
			
			map.put("440600",new Area("440600","佛山市","440000"));
				map.put("440604",new Area("440604","禅城区","440600"));
				map.put("440605",new Area("440605","南海区","440600"));
				map.put("440606",new Area("440606","顺德区","440600"));
				map.put("440607",new Area("440607","三水区","440600"));
				map.put("440608",new Area("440608","高明区","440600"));
			
			
			map.put("440700",new Area("440700","江门市","440000"));
				map.put("440703",new Area("440703","蓬江区","440700"));
				map.put("440704",new Area("440704","江海区","440700"));
				map.put("440705",new Area("440705","新会区","440700"));
				map.put("440781",new Area("440781","台山市","440700"));
				map.put("440783",new Area("440783","开平市","440700"));
				map.put("440784",new Area("440784","鹤山市","440700"));
				map.put("440785",new Area("440785","恩平市","440700"));
			
			
			map.put("440800",new Area("440800","湛江市","440000"));
				map.put("440802",new Area("440802","赤坎区","440800"));
				map.put("440803",new Area("440803","霞山区","440800"));
				map.put("440804",new Area("440804","坡头区","440800"));
				map.put("440811",new Area("440811","麻章区","440800"));
				map.put("440823",new Area("440823","遂溪县","440800"));
				map.put("440825",new Area("440825","徐闻县","440800"));
				map.put("440881",new Area("440881","廉江市","440800"));
				map.put("440882",new Area("440882","雷州市","440800"));
				map.put("440883",new Area("440883","吴川市","440800"));
			
			
			map.put("440900",new Area("440900","茂名市","440000"));
				map.put("440902",new Area("440902","茂南区","440900"));
				map.put("440903",new Area("440903","茂港区","440900"));
				map.put("440923",new Area("440923","电白县","440900"));
				map.put("440981",new Area("440981","高州市","440900"));
				map.put("440982",new Area("440982","化州市","440900"));
				map.put("440983",new Area("440983","信宜市","440900"));
			
			
			map.put("441200",new Area("441200","肇庆市","440000"));
				map.put("441202",new Area("441202","端州区","441200"));
				map.put("441203",new Area("441203","鼎湖区","441200"));
				map.put("441223",new Area("441223","广宁县","441200"));
				map.put("441224",new Area("441224","怀集县","441200"));
				map.put("441225",new Area("441225","封开县","441200"));
				map.put("441226",new Area("441226","德庆县","441200"));
				map.put("441283",new Area("441283","高要市","441200"));
				map.put("441284",new Area("441284","四会市","441200"));
			
			
			map.put("441300",new Area("441300","惠州市","440000"));
				map.put("441302",new Area("441302","惠城区","441300"));
				map.put("441303",new Area("441303","惠阳区","441300"));
				map.put("441322",new Area("441322","博罗县","441300"));
				map.put("441323",new Area("441323","惠东县","441300"));
				map.put("441324",new Area("441324","龙门县","441300"));
			
			
			map.put("441400",new Area("441400","梅州市","440000"));
				map.put("441402",new Area("441402","梅江区","441400"));
				map.put("441421",new Area("441421","梅县","441400"));
				map.put("441422",new Area("441422","大埔县","441400"));
				map.put("441423",new Area("441423","丰顺县","441400"));
				map.put("441424",new Area("441424","五华县","441400"));
				map.put("441426",new Area("441426","平远县","441400"));
				map.put("441427",new Area("441427","蕉岭县","441400"));
				map.put("441481",new Area("441481","兴宁市","441400"));
			
			
			map.put("441500",new Area("441500","汕尾市","440000"));
				map.put("441502",new Area("441502","城区","441500"));
				map.put("441521",new Area("441521","海丰县","441500"));
				map.put("441523",new Area("441523","陆河县","441500"));
				map.put("441581",new Area("441581","陆丰市","441500"));
			
			
			map.put("441600",new Area("441600","河源市","440000"));
				map.put("441602",new Area("441602","源城区","441600"));
				map.put("441621",new Area("441621","紫金县","441600"));
				map.put("441622",new Area("441622","龙川县","441600"));
				map.put("441623",new Area("441623","连平县","441600"));
				map.put("441624",new Area("441624","和平县","441600"));
				map.put("441625",new Area("441625","东源县","441600"));
			
			
			map.put("441700",new Area("441700","阳江市","440000"));
				map.put("441702",new Area("441702","江城区","441700"));
				map.put("441721",new Area("441721","阳西县","441700"));
				map.put("441723",new Area("441723","阳东县","441700"));
				map.put("441781",new Area("441781","阳春市","441700"));
			
			
			map.put("441800",new Area("441800","清远市","440000"));
				map.put("441802",new Area("441802","清城区","441800"));
				map.put("441821",new Area("441821","佛冈县","441800"));
				map.put("441823",new Area("441823","阳山县","441800"));
				map.put("441825",new Area("441825","连山壮族瑶族自治县","441800"));
				map.put("441826",new Area("441826","连南瑶族自治县","441800"));
				map.put("441827",new Area("441827","清新县","441800"));
				map.put("441881",new Area("441881","英德市","441800"));
				map.put("441882",new Area("441882","连州市","441800"));
			
			
			map.put("441900",new Area("441900","东莞市","440000"));
			
			
			map.put("442000",new Area("442000","中山市","440000"));
			
			
			map.put("445100",new Area("445100","潮州市","440000"));
				map.put("445102",new Area("445102","湘桥区","445100"));
				map.put("445121",new Area("445121","潮安县","445100"));
				map.put("445122",new Area("445122","饶平县","445100"));
				map.put("445185",new Area("445185","枫溪区","445100"));
			
			
			map.put("445200",new Area("445200","揭阳市","440000"));
				map.put("445202",new Area("445202","榕城区","445200"));
				map.put("445221",new Area("445221","揭东县","445200"));
				map.put("445222",new Area("445222","揭西县","445200"));
				map.put("445224",new Area("445224","惠来县","445200"));
				map.put("445281",new Area("445281","普宁市","445200"));
				map.put("445284",new Area("445284","东山区","445200"));
			
			
			map.put("445300",new Area("445300","云浮市","440000"));
				map.put("445302",new Area("445302","云城区","445300"));
				map.put("445321",new Area("445321","新兴县","445300"));
				map.put("445322",new Area("445322","郁南县","445300"));
				map.put("445323",new Area("445323","云安县","445300"));
				map.put("445381",new Area("445381","罗定市","445300"));
		
			
		/*
		 * 广西壮族自治区
		 */
		map.put("450000",new Area("450000","广西壮族自治区","0"));
			map.put("450100",new Area("450100","南宁市","450000"));
				map.put("450102",new Area("450102","兴宁区","450100"));
				map.put("450103",new Area("450103","青秀区","450100"));
				map.put("450105",new Area("450105","江南区","450100"));
				map.put("450107",new Area("450107","西乡塘区","450100"));
				map.put("450108",new Area("450108","良庆区","450100"));
				map.put("450109",new Area("450109","邕宁区","450100"));
				map.put("450122",new Area("450122","武鸣县","450100"));
				map.put("450123",new Area("450123","隆安县","450100"));
				map.put("450124",new Area("450124","马山县","450100"));
				map.put("450125",new Area("450125","上林县","450100"));
				map.put("450126",new Area("450126","宾阳县","450100"));
				map.put("450127",new Area("450127","横县","450100"));
				
			
			map.put("450200",new Area("450200","柳州市","450000"));
				map.put("450202",new Area("450202","城中区","450200"));
				map.put("450203",new Area("450203","鱼峰区","450200"));
				map.put("450204",new Area("450204","柳南区","450200"));
				map.put("450205",new Area("450205","柳北区","450200"));
				map.put("450221",new Area("450221","柳江县","450200"));
				map.put("450222",new Area("450222","柳城县","450200"));
				map.put("450223",new Area("450223","鹿寨县","450200"));
				map.put("450224",new Area("450224","融安县","450200"));
				map.put("450225",new Area("450225","融水苗族自治县","450200"));
				map.put("450226",new Area("450226","三江侗族自治县","450200"));
			
			
			map.put("450300",new Area("450300","桂林市","450000"));
				map.put("450302",new Area("450302","秀峰区","450300"));
				map.put("450303",new Area("450303","叠彩区","450300"));
				map.put("450304",new Area("450304","象山区","450300"));
				map.put("450305",new Area("450305","七星区","450300"));
				map.put("450311",new Area("450311","雁山区","450300"));
				map.put("450321",new Area("450321","阳朔县","450300"));
				map.put("450322",new Area("450322","临桂县","450300"));
				map.put("450323",new Area("450323","灵川县","450300"));
				map.put("450324",new Area("450324","全州县","450300"));
				map.put("450325",new Area("450325","兴安县","450300"));
				map.put("450326",new Area("450326","永福县","450300"));
				map.put("450327",new Area("450327","灌阳县","450300"));
				map.put("450328",new Area("450328","龙胜各族自治县","450300"));
				map.put("450329",new Area("450329","资源县","450300"));
				map.put("450330",new Area("450330","平乐县","450300"));
				map.put("450331",new Area("450331","荔浦县","450300"));
				map.put("450332",new Area("450332","恭城瑶族自治县","450300"));
			
			
			map.put("450400",new Area("450400","梧州市","450000"));
				map.put("450403",new Area("450403","万秀区","450400"));
				map.put("450404",new Area("450404","蝶山区","450400"));
				map.put("450405",new Area("450405","长洲区","450400"));
				map.put("450421",new Area("450421","苍梧县","450400"));
				map.put("450422",new Area("450422","藤县","450400"));
				map.put("450423",new Area("450423","蒙山县","450400"));
				map.put("450481",new Area("450481","岑溪市","450400"));
			
			
			map.put("450500",new Area("450500","北海市","450000"));
				map.put("450502",new Area("450502","海城区","450500"));
				map.put("450503",new Area("450503","银海区","450500"));
				map.put("450512",new Area("450512","铁山港区","450500"));
				map.put("450521",new Area("450521","合浦县","450500"));
			
			
			map.put("450600",new Area("450600","防城港市","450000"));
				map.put("450602",new Area("450602","港口区","450600"));
				map.put("450603",new Area("450603","防城区","450600"));
				map.put("450612",new Area("450612","上思县","450600"));
				map.put("450621",new Area("450621","东兴市","450600"));
			
			
			map.put("450700",new Area("450700","钦州市","450000"));
				map.put("450702",new Area("450702","钦南区","450700"));
				map.put("450703",new Area("450703","钦北区","450700"));
				map.put("450721",new Area("450721","灵山县","450700"));
				map.put("450722",new Area("450722","浦北县","450700"));
			
			
			map.put("450800",new Area("450800","贵港市","450000"));
				map.put("450802",new Area("450802","港北区","450800"));
				map.put("450803",new Area("450803","港南区","450800"));
				map.put("450804",new Area("450804","覃塘区","450800"));
				map.put("450821",new Area("450821","平南县","450800"));
				map.put("450881",new Area("450881","桂平市","450800"));
			
			
			map.put("450900",new Area("450900","玉林市","450000"));
				map.put("450902",new Area("450902","玉州区","450900"));
				map.put("450921",new Area("450921","容县","450900"));
				map.put("450922",new Area("450922","陆川县","450900"));
				map.put("450923",new Area("450923","博白县","450900"));
				map.put("450924",new Area("450924","兴业县","450900"));
				map.put("450981",new Area("450981","北流市","450900"));
			
			
			map.put("451000",new Area("451000","百色市","450000"));
				map.put("451002",new Area("451002","右江区","451000"));
				map.put("451021",new Area("451021","田阳县","451000"));
				map.put("451022",new Area("451022","田东县","451000"));
				map.put("451023",new Area("451023","平果县","451000"));
				map.put("451024",new Area("451024","德保县","451000"));
				map.put("451025",new Area("451025","靖西县","451000"));
				map.put("451026",new Area("451026","那坡县","451000"));
				map.put("451027",new Area("451027","凌云县","451000"));
				map.put("451028",new Area("451028","乐业县","451000"));
				map.put("451029",new Area("451029","田林县","451000"));
				map.put("451030",new Area("451030","西林县","451000"));
				map.put("451031",new Area("451031","隆林各族自治县","451000"));
			
			
			map.put("451100",new Area("451100","贺州市","450000"));
				map.put("451102",new Area("451102","八步区","451100"));
				map.put("451121",new Area("451121","昭平县","451100"));
				map.put("451122",new Area("451122","钟山县","451100"));
				map.put("451123",new Area("451123","富川瑶族自治县","451100"));
			
			
			map.put("451200",new Area("451200","河池市","450000"));
				map.put("451202",new Area("451202","金城江区","451200"));
				map.put("451221",new Area("451221","南丹县","451200"));
				map.put("451222",new Area("451222","天峨县","451200"));
				map.put("451223",new Area("451223","凤山县","451200"));
				map.put("451224",new Area("451224","东兰县","451200"));
				map.put("451225",new Area("451225","罗城仫佬族自治县","451200"));
				map.put("451226",new Area("451226","环江毛南族自治县","451200"));
				map.put("451227",new Area("451227","巴马瑶族自治县","451200"));
				map.put("451228",new Area("451228","都安瑶族自治县","451200"));
				map.put("451229",new Area("451229","大化瑶族自治县","451200"));
				map.put("451281",new Area("451281","宜州市","451200"));
			
			map.put("451300",new Area("451300","来宾市","450000"));
				map.put("451302",new Area("451302","兴宾区","451300"));
				map.put("451321",new Area("451321","忻城县","451300"));
				map.put("451322",new Area("451322","象州县","451300"));
				map.put("451323",new Area("451323","武宣县","451300"));
				map.put("451324",new Area("451324","金秀瑶族自治县","451300"));
				map.put("451381",new Area("451381","合山市","451300"));
			
			
			map.put("451400",new Area("451400","崇左市","450000"));
				map.put("451402",new Area("451402","江洲区","451400"));
				map.put("451421",new Area("451421","扶绥县","451400"));
				map.put("451422",new Area("451422","宁明县","451400"));
				map.put("451423",new Area("451423","龙州县","451400"));
				map.put("451424",new Area("451424","大新县","451400"));
				map.put("451425",new Area("451425","天等县","451400"));
				map.put("451481",new Area("451481","凭祥市","451400"));
		
			
			
		/*
		 * 海南省
		 */
		map.put("460000",new Area("460000","海南省","0"));
			map.put("460100",new Area("460100","海口市","460000"));
				map.put("460105",new Area("460105","秀英区","460100"));
				map.put("460106",new Area("460106","龙华区","460100"));
				map.put("460107",new Area("460107","琼山区","460100"));
				map.put("460108",new Area("460108","美兰区","460100"));
			
			
			map.put("460200",new Area("460200","三亚市","460000"));
			map.put("469001",new Area("469001","五指山市","460000"));
			map.put("469002",new Area("469002","琼海市","460000"));
			map.put("469003",new Area("469003","儋州市","460000"));
			map.put("469005",new Area("469005","文昌市","460000"));
			map.put("469006",new Area("469006","万宁市","460000"));
			map.put("469007",new Area("469007","东方市","460000"));
			map.put("469025",new Area("469025","定安县","460000"));
			map.put("469026",new Area("469026","屯昌县","460000"));
			map.put("469027",new Area("469027","澄迈县","460000"));
			map.put("469028",new Area("469028","临高县","460000"));
			map.put("469030",new Area("469030","白沙黎族自治县","460000"));
			map.put("469031",new Area("469031","昌江黎族自治县","460000"));
			map.put("469033",new Area("469033","乐东黎族自治县","460000"));
			map.put("469034",new Area("469034","陵水黎族自治县","460000"));
			map.put("469035",new Area("469035","保亭黎族苗族自治县","460000"));
			map.put("469036",new Area("469036","琼中黎族苗族自治县","460000"));
			map.put("469037",new Area("469037","西沙群岛","460000"));
			map.put("469038",new Area("469038","南沙群岛","460000"));
			map.put("469039",new Area("469039","中沙群岛的岛礁及其海域","460000"));
			
		/*
		 * 重庆市
		 */
		map.put("500000",new Area("500000","重庆","0"));
			map.put("500100",new Area("500100","重庆市","500000"));
				map.put("500101",new Area("500101","万州区","500100"));
				map.put("500102",new Area("500102","涪陵区","500100"));
				map.put("500103",new Area("500103","渝中区","500100"));
				map.put("500104",new Area("500104","大渡口区","500100"));
				map.put("500105",new Area("500105","江北区","500100"));
				map.put("500106",new Area("500106","沙坪坝区","500100"));
				map.put("500107",new Area("500107","九龙坡区","500100"));
				map.put("500108",new Area("500108","南岸区","500100"));
				map.put("500109",new Area("500109","北碚区","500100"));
				map.put("500110",new Area("500110","万盛区","500100"));
				map.put("500111",new Area("500111","双桥区","500100"));
				map.put("500112",new Area("500112","渝北区","500100"));
				map.put("500113",new Area("500113","巴南区","500100"));
				map.put("500114",new Area("500114","黔江区","500100"));
				map.put("500115",new Area("500115","长寿区","500100"));
				map.put("500122",new Area("500122","綦江县","500100"));
				map.put("500123",new Area("500123","潼南县","500100"));
				map.put("500124",new Area("500124","铜梁县","500100"));
				map.put("500125",new Area("500125","大足县","500100"));
				map.put("500126",new Area("500126","荣昌县","500100"));
				map.put("500127",new Area("500127","璧山县","500100"));
				map.put("500128",new Area("500128","梁平县","500100"));
				map.put("500129",new Area("500129","城口县","500100"));
				map.put("500130",new Area("500130","丰都县","500100"));
				map.put("500131",new Area("500131","垫江县","500100"));
				map.put("500132",new Area("500132","武隆县","500100"));
				map.put("500133",new Area("500133","忠县","500100"));
				map.put("500134",new Area("500134","开县","500100"));
				map.put("500135",new Area("500135","云阳县","500100"));
				map.put("500136",new Area("500136","奉节县","500100"));
				map.put("500137",new Area("500137","巫山县","500100"));
				map.put("500138",new Area("500138","巫溪县","500100"));
				map.put("500140",new Area("500140","石柱土家族自治县","500100"));
				map.put("500141",new Area("500141","秀山土家族苗族自治县","500100"));
				map.put("500142",new Area("500142","酉阳土家族苗族自治县","500100"));
				map.put("500143",new Area("500143","彭水苗族土家族自治县","500100"));
				map.put("500181",new Area("500181","江津区","500100"));
				map.put("500182",new Area("500182","合川区","500100"));
				map.put("500183",new Area("500183","永川区","500100"));
				map.put("500184",new Area("500184","南川区","500100"));

		/*
		 * 四川省
		 */
		map.put("510000",new Area("510000","四川省","0"));
			map.put("510100",new Area("510100","成都市","510000"));
				map.put("510104",new Area("510104","锦江区","510100"));
				map.put("510105",new Area("510105","青羊区","510100"));
				map.put("510106",new Area("510106","金牛区","510100"));
				map.put("510107",new Area("510107","武侯区","510100"));
				map.put("510108",new Area("510108","成华区","510100"));
				map.put("510112",new Area("510112","龙泉驿区","510100"));
				map.put("510113",new Area("510113","青白江区","510100"));
				map.put("510114",new Area("510114","新都区","510100"));
				map.put("510115",new Area("510115","温江区","510100"));
				map.put("510121",new Area("510121","金堂县","510100"));
				map.put("510122",new Area("510122","双流县","510100"));
				map.put("510124",new Area("510124","郫县","510100"));
				map.put("510129",new Area("510129","大邑县","510100"));
				map.put("510131",new Area("510131","蒲江县","510100"));
				map.put("510132",new Area("510132","新津县","510100"));
				map.put("510181",new Area("510181","都江堰市","510100"));
				map.put("510182",new Area("510182","彭州市","510100"));
				map.put("510183",new Area("510183","邛崃市","510100"));
				map.put("510184",new Area("510184","崇州市","510100"));
			
			
			map.put("510300",new Area("510300","自贡市","510000"));
				map.put("510302",new Area("510302","自流井区","510300"));
				map.put("510303",new Area("510303","贡井区","510300"));
				map.put("510304",new Area("510304","大安区","510300"));
				map.put("510311",new Area("510311","沿滩区","510300"));
				map.put("510321",new Area("510321","荣县","510300"));
				map.put("510322",new Area("510322","富顺县","510300"));
			
			
			map.put("510400",new Area("510400","攀枝花市","510000"));
				map.put("510402",new Area("510402","东区","510400"));
				map.put("510403",new Area("510403","西区","510400"));
				map.put("510411",new Area("510411","仁和区","510400"));
				map.put("510421",new Area("510421","米易县","510400"));
				map.put("510422",new Area("510422","盐边县","510400"));
			
			
			map.put("510500",new Area("510500","泸州市","510000"));
				map.put("510502",new Area("510502","江阳区","510500"));
				map.put("510503",new Area("510503","纳溪区","510500"));
				map.put("510504",new Area("510504","龙马潭区","510500"));
				map.put("510521",new Area("510521","泸县","510500"));
				map.put("510522",new Area("510522","合江县","510500"));
				map.put("510524",new Area("510524","叙永县","510500"));
				map.put("510525",new Area("510525","古蔺县","510500"));
			
			
			map.put("510600",new Area("510600","德阳市","510000"));
				map.put("510603",new Area("510603","旌阳区","510600"));
				map.put("510623",new Area("510623","中江县","510600"));
				map.put("510626",new Area("510626","罗江县","510600"));
				map.put("510681",new Area("510681","广汉市","510600"));
				map.put("510682",new Area("510682","什邡市","510600"));
				map.put("510683",new Area("510683","绵竹市","510600"));
			
			
			map.put("510700",new Area("510700","绵阳市","510000"));
				map.put("510703",new Area("510703","涪城区","510700"));
				map.put("510704",new Area("510704","游仙区","510700"));
				map.put("510722",new Area("510722","三台县","510700"));
				map.put("510723",new Area("510723","盐亭县","510700"));
				map.put("510724",new Area("510724","安县","510700"));
				map.put("510725",new Area("510725","梓潼县","510700"));
				map.put("510726",new Area("510726","北川羌族自治县","510700"));
				map.put("510727",new Area("510727","平武县","510700"));
				map.put("510751",new Area("510751","高新区","510700"));
				map.put("510781",new Area("510781","江油市","510700"));
			
			
			map.put("510800",new Area("510800","广元市","510000"));
				map.put("510802",new Area("510802","利州区","510800"));
				map.put("510811",new Area("510811","元坝区","510800"));
				map.put("510812",new Area("510812","朝天区","510800"));
				map.put("510821",new Area("510821","旺苍县","510800"));
				map.put("510822",new Area("510822","青川县","510800"));
				map.put("510823",new Area("510823","剑阁县","510800"));
				map.put("510824",new Area("510824","苍溪县","510800"));
			
			
			map.put("510900",new Area("510900","遂宁市","510000"));
				map.put("510903",new Area("510903","船山区","510900"));
				map.put("510904",new Area("510904","安居区","510900"));
				map.put("510921",new Area("510921","蓬溪县","510900"));
				map.put("510922",new Area("510922","射洪县","510900"));
				map.put("510923",new Area("510923","大英县","510900"));
			
			
			map.put("511000",new Area("511000","内江市","510000"));
				map.put("511002",new Area("511002","市中区","511000"));
				map.put("511011",new Area("511011","东兴区","511000"));
				map.put("511024",new Area("511024","威远县","511000"));
				map.put("511025",new Area("511025","资中县","511000"));
				map.put("511028",new Area("511028","隆昌县","511000"));
			
			
			map.put("511100",new Area("511100","乐山市","510000"));
				map.put("511102",new Area("511102","市中区","511100"));
				map.put("511111",new Area("511111","沙湾区","511100"));
				map.put("511112",new Area("511112","五通桥区","511100"));
				map.put("511113",new Area("511113","金口河区","511100"));
				map.put("511123",new Area("511123","犍为县","511100"));
				map.put("511124",new Area("511124","井研县","511100"));
				map.put("511126",new Area("511126","夹江县","511100"));
				map.put("511129",new Area("511129","沐川县","511100"));
				map.put("511132",new Area("511132","峨边彝族自治县","511100"));
				map.put("511133",new Area("511133","马边彝族自治县","511100"));
				map.put("511181",new Area("511181","峨眉山市","511100"));
			
			
			map.put("511300",new Area("511300","南充市","510000"));
				map.put("511302",new Area("511302","顺庆区","511300"));
				map.put("511303",new Area("511303","高坪区","511300"));
				map.put("511304",new Area("511304","嘉陵区","511300"));
				map.put("511321",new Area("511321","南部县","511300"));
				map.put("511322",new Area("511322","营山县","511300"));
				map.put("511323",new Area("511323","蓬安县","511300"));
				map.put("511324",new Area("511324","仪陇县","511300"));
				map.put("511325",new Area("511325","西充县","511300"));
				map.put("511381",new Area("511381","阆中市","511300"));
			
			
			map.put("511400",new Area("511400","眉山市","510000"));
				map.put("511402",new Area("511402","东坡区","511400"));
				map.put("511421",new Area("511421","仁寿县","511400"));
				map.put("511422",new Area("511422","彭山县","511400"));
				map.put("511423",new Area("511423","洪雅县","511400"));
				map.put("511424",new Area("511424","丹棱县","511400"));
				map.put("511425",new Area("511425","青神县","511400"));
			
			
			map.put("511500",new Area("511500","宜宾市","510000"));
				map.put("511502",new Area("511502","翠屏区","511500"));
				map.put("511521",new Area("511521","宜宾县","511500"));
				map.put("511522",new Area("511522","南溪县","511500"));
				map.put("511523",new Area("511523","江安县","511500"));
				map.put("511524",new Area("511524","长宁县","511500"));
				map.put("511525",new Area("511525","高县","511500"));
				map.put("511526",new Area("511526","珙县","511500"));
				map.put("511527",new Area("511527","筠连县","511500"));
				map.put("511528",new Area("511528","兴文县","511500"));
				map.put("511529",new Area("511529","屏山县","511500"));
			
			
			map.put("511600",new Area("511600","广安市","510000"));
				map.put("511602",new Area("511602","广安区","511600"));
				map.put("511621",new Area("511621","岳池县","511600"));
				map.put("511622",new Area("511622","武胜县","511600"));
				map.put("511623",new Area("511623","邻水县","511600"));
				map.put("511681",new Area("511681","华蓥市","511600"));
				map.put("511682",new Area("511682","市辖区","511600"));
			
			
			map.put("511700",new Area("511700","达州市","510000"));
				map.put("511702",new Area("511702","通川区","511700"));
				map.put("511721",new Area("511721","达县","511700"));
				map.put("511722",new Area("511722","宣汉县","511700"));
				map.put("511723",new Area("511723","开江县","511700"));
				map.put("511724",new Area("511724","大竹县","511700"));
				map.put("511725",new Area("511725","渠县","511700"));
				map.put("511781",new Area("511781","万源市","511700"));
			
			
			map.put("511800",new Area("511800","雅安市","510000"));
				map.put("511802",new Area("511802","雨城区","511800"));
				map.put("511821",new Area("511821","名山县","511800"));
				map.put("511822",new Area("511822","荥经县","511800"));
				map.put("511823",new Area("511823","汉源县","511800"));
				map.put("511824",new Area("511824","石棉县","511800"));
				map.put("511825",new Area("511825","天全县","511800"));
				map.put("511826",new Area("511826","芦山县","511800"));
				map.put("511827",new Area("511827","宝兴县","511800"));
			
			
			map.put("511900",new Area("511900","巴中市","510000"));
				map.put("511902",new Area("511902","巴州区","511900"));
				map.put("511921",new Area("511921","通江县","511900"));
				map.put("511922",new Area("511922","南江县","511900"));
				map.put("511923",new Area("511923","平昌县","511900"));
			
			
			map.put("512000",new Area("512000","资阳市","510000"));
				map.put("512002",new Area("512002","雁江区","512000"));
				map.put("512021",new Area("512021","安岳县","512000"));
				map.put("512022",new Area("512022","乐至县","512000"));
				map.put("512081",new Area("512081","简阳市","512000"));
			
			
			map.put("513200",new Area("513200","阿坝藏族羌族自治州","510000"));
				map.put("513221",new Area("513221","汶川县","513200"));
				map.put("513222",new Area("513222","理县","513200"));
				map.put("513223",new Area("513223","茂县","513200"));
				map.put("513224",new Area("513224","松潘县","513200"));
				map.put("513225",new Area("513225","九寨沟县","513200"));
				map.put("513226",new Area("513226","金川县","513200"));
				map.put("513227",new Area("513227","小金县","513200"));
				map.put("513228",new Area("513228","黑水县","513200"));
				map.put("513229",new Area("513229","马尔康县","513200"));
				map.put("513230",new Area("513230","壤塘县","513200"));
				map.put("513231",new Area("513231","阿坝县","513200"));
				map.put("513232",new Area("513232","若尔盖县","513200"));
				map.put("513233",new Area("513233","红原县","513200"));
			
			
			map.put("513300",new Area("513300","甘孜藏族自治州","510000"));
				map.put("513321",new Area("513321","康定县","513300"));
				map.put("513322",new Area("513322","泸定县","513300"));
				map.put("513323",new Area("513323","丹巴县","513300"));
				map.put("513324",new Area("513324","九龙县","513300"));
				map.put("513325",new Area("513325","雅江县","513300"));
				map.put("513326",new Area("513326","道孚县","513300"));
				map.put("513327",new Area("513327","炉霍县","513300"));
				map.put("513328",new Area("513328","甘孜县","513300"));
				map.put("513329",new Area("513329","新龙县","513300"));
				map.put("513330",new Area("513330","德格县","513300"));
				map.put("513331",new Area("513331","白玉县","513300"));
				map.put("513332",new Area("513332","石渠县","513300"));
				map.put("513333",new Area("513333","色达县","513300"));
				map.put("513334",new Area("513334","理塘县","513300"));
				map.put("513335",new Area("513335","巴塘县","513300"));
				map.put("513336",new Area("513336","乡城县","513300"));
				map.put("513337",new Area("513337","稻城县","513300"));
				map.put("513338",new Area("513338","得荣县","513300"));
			
			
			map.put("513400",new Area("513400","凉山彝族自治州","510000"));
				map.put("513401",new Area("513401","西昌市","513400"));
				map.put("513422",new Area("513422","木里藏族自治县","513400"));
				map.put("513423",new Area("513423","盐源县","513400"));
				map.put("513424",new Area("513424","德昌县","513400"));
				map.put("513425",new Area("513425","会理县","513400"));
				map.put("513426",new Area("513426","会东县","513400"));
				map.put("513427",new Area("513427","宁南县","513400"));
				map.put("513428",new Area("513428","普格县","513400"));
				map.put("513429",new Area("513429","布拖县","513400"));
				map.put("513430",new Area("513430","金阳县","513400"));
				map.put("513431",new Area("513431","昭觉县","513400"));
				map.put("513432",new Area("513432","喜德县","513400"));
				map.put("513433",new Area("513433","冕宁县","513400"));
				map.put("513434",new Area("513434","越西县","513400"));
				map.put("513435",new Area("513435","甘洛县","513400"));
				map.put("513436",new Area("513436","美姑县","513400"));
				map.put("513437",new Area("513437","雷波县","513400"));
			
		/*
		 * 贵州省
		 */
		map.put("520000",new Area("520000","贵州省","0"));
			map.put("520100",new Area("520100","贵阳市","520000"));
				map.put("520102",new Area("520102","南明区","520100"));
				map.put("520103",new Area("520103","云岩区","520100"));
				map.put("520111",new Area("520111","花溪区","520100"));
				map.put("520112",new Area("520112","乌当区","520100"));
				map.put("520113",new Area("520113","白云区","520100"));
				map.put("520114",new Area("520114","小河区","520100"));
				map.put("520121",new Area("520121","开阳县","520100"));
				map.put("520122",new Area("520122","息烽县","520100"));
				map.put("520123",new Area("520123","修文县","520100"));
				map.put("520151",new Area("520151","金阳开发区","520100"));
				map.put("520181",new Area("520181","清镇市","520100"));
			
			map.put("520200",new Area("520200","六盘水市","520000"));
				map.put("520201",new Area("520201","钟山区","520200"));
				map.put("520203",new Area("520203","六枝特区","520200"));
				map.put("520221",new Area("520221","水城县","520200"));
				map.put("520222",new Area("520222","盘县","520200"));
			
			map.put("520300",new Area("520300","遵义市","520000"));
				map.put("520302",new Area("520302","红花岗区","520300"));
				map.put("520303",new Area("520303","汇川区","520300"));
				map.put("520321",new Area("520321","遵义县","520300"));
				map.put("520322",new Area("520322","桐梓县","520300"));
				map.put("520323",new Area("520323","绥阳县","520300"));
				map.put("520324",new Area("520324","正安县","520300"));
				map.put("520325",new Area("520325","道真仡佬族苗族自治县","520300"));
				map.put("520326",new Area("520326","务川仡佬族苗族自治县","520300"));
				map.put("520327",new Area("520327","凤冈县","520300"));
				map.put("520328",new Area("520328","湄潭县","520300"));
				map.put("520329",new Area("520329","余庆县","520300"));
				map.put("520330",new Area("520330","习水县","520300"));
				map.put("520381",new Area("520381","赤水市","520300"));
				map.put("520382",new Area("520382","仁怀市","520300"));
			
			map.put("520400",new Area("520400","安顺市","520000"));
				map.put("520402",new Area("520402","西秀区","520400"));
				map.put("520421",new Area("520421","平坝县","520400"));
				map.put("520422",new Area("520422","普定县","520400"));
				map.put("520423",new Area("520423","镇宁布依族苗族自治县","520400"));
				map.put("520424",new Area("520424","关岭布依族苗族自治县","520400"));
				map.put("520425",new Area("520425","紫云苗族布依族自治县","520400"));
			
			map.put("522200",new Area("522200","铜仁地区","520000"));
				map.put("522201",new Area("522201","铜仁市","522200"));
				map.put("522222",new Area("522222","江口县","522200"));
				map.put("522223",new Area("522223","玉屏侗族自治县","522200"));
				map.put("522224",new Area("522224","石阡县","522200"));
				map.put("522225",new Area("522225","思南县","522200"));
				map.put("522226",new Area("522226","印江土家族苗族自治县","522200"));
				map.put("522227",new Area("522227","德江县","522200"));
				map.put("522228",new Area("522228","沿河土家族自治县","522200"));
				map.put("522229",new Area("522229","松桃苗族自治县","522200"));
				map.put("522230",new Area("522230","万山特区","522200"));
			
			map.put("522300",new Area("522300","黔西南布依族苗族自治州","520000"));
				map.put("522301",new Area("522301","兴义市","522300"));
				map.put("522322",new Area("522322","兴仁县","522300"));
				map.put("522323",new Area("522323","普安县","522300"));
				map.put("522324",new Area("522324","晴隆县","522300"));
				map.put("522325",new Area("522325","贞丰县","522300"));
				map.put("522326",new Area("522326","望谟县","522300"));
				map.put("522327",new Area("522327","册亨县","522300"));
				map.put("522328",new Area("522328","安龙县","522300"));
			
			map.put("522400",new Area("522400","毕节地区","520000"));
				map.put("522401",new Area("522401","毕节市","522400"));
				map.put("522422",new Area("522422","大方县","522400"));
				map.put("522423",new Area("522423","黔西县","522400"));
				map.put("522424",new Area("522424","金沙县","522400"));
				map.put("522425",new Area("522425","织金县","522400"));
				map.put("522426",new Area("522426","纳雍县","522400"));
				map.put("522427",new Area("522427","威宁彝族回族苗族自治县","522400"));
				map.put("522428",new Area("522428","赫章县","522400"));
			
			map.put("522600",new Area("522600","黔东南苗族侗族自治州","520000"));
				map.put("522601",new Area("522601","凯里市","522600"));
				map.put("522622",new Area("522622","黄平县","522600"));
				map.put("522623",new Area("522623","施秉县","522600"));
				map.put("522624",new Area("522624","三穗县","522600"));
				map.put("522625",new Area("522625","镇远县","522600"));
				map.put("522626",new Area("522626","岑巩县","522600"));
				map.put("522627",new Area("522627","天柱县","522600"));
				map.put("522628",new Area("522628","锦屏县","522600"));
				map.put("522629",new Area("522629","剑河县","522600"));
				map.put("522630",new Area("522630","台江县","522600"));
				map.put("522631",new Area("522631","黎平县","522600"));
				map.put("522632",new Area("522632","榕江县","522600"));
				map.put("522633",new Area("522633","从江县","522600"));
				map.put("522634",new Area("522634","雷山县","522600"));
				map.put("522635",new Area("522635","麻江县","522600"));
				map.put("522636",new Area("522636","丹寨县","522600"));
			
			map.put("522700",new Area("522700","黔南布依族苗族自治州","520000"));
				map.put("522701",new Area("522701","都匀市","522700"));
				map.put("522702",new Area("522702","福泉市","522700"));
				map.put("522722",new Area("522722","荔波县","522700"));
				map.put("522723",new Area("522723","贵定县","522700"));
				map.put("522725",new Area("522725","瓮安县","522700"));
				map.put("522726",new Area("522726","独山县","522700"));
				map.put("522727",new Area("522727","平塘县","522700"));
				map.put("522728",new Area("522728","罗甸县","522700"));
				map.put("522729",new Area("522729","长顺县","522700"));
				map.put("522730",new Area("522730","龙里县","522700"));
				map.put("522731",new Area("522731","惠水县","522700"));
				map.put("522732",new Area("522732","三都水族自治县","522700"));
		
			
		/*
		 * 云南省
		 */
		map.put("530000",new Area("530000","云南省","0"));
			map.put("530100",new Area("530100","昆明市","530000"));
				map.put("530102",new Area("530102","五华区","530100"));
				map.put("530103",new Area("530103","盘龙区","530100"));
				map.put("530111",new Area("530111","官渡区","530100"));
				map.put("530112",new Area("530112","西山区","530100"));
				map.put("530113",new Area("530113","东川区","530100"));
				map.put("530121",new Area("530121","呈贡县","530100"));
				map.put("530122",new Area("530122","晋宁县","530100"));
				map.put("530124",new Area("530124","富民县","530100"));
				map.put("530125",new Area("530125","宜良县","530100"));
				map.put("530126",new Area("530126","石林彝族自治县","530100"));
				map.put("530127",new Area("530127","嵩明县","530100"));
				map.put("530128",new Area("530128","禄劝彝族苗族自治县","530100"));
				map.put("530129",new Area("530129","寻甸回族彝族自治县","530100"));
				map.put("530181",new Area("530181","安宁市","530100"));
			
			
			map.put("530300",new Area("530300","曲靖市","530000"));
				map.put("530302",new Area("530302","麒麟区","530300"));
				map.put("530321",new Area("530321","马龙县","530300"));
				map.put("530322",new Area("530322","陆良县","530300"));
				map.put("530323",new Area("530323","师宗县","530300"));
				map.put("530324",new Area("530324","罗平县","530300"));
				map.put("530325",new Area("530325","富源县","530300"));
				map.put("530326",new Area("530326","会泽县","530300"));
				map.put("530328",new Area("530328","沾益县","530300"));
				map.put("530381",new Area("530381","宣威市","530300"));
			
			
			map.put("530400",new Area("530400","玉溪市","530000"));
				map.put("530402",new Area("530402","红塔区","530400"));
				map.put("530421",new Area("530421","江川县","530400"));
				map.put("530422",new Area("530422","澄江县","530400"));
				map.put("530423",new Area("530423","通海县","530400"));
				map.put("530424",new Area("530424","华宁县","530400"));
				map.put("530425",new Area("530425","易门县","530400"));
				map.put("530426",new Area("530426","峨山彝族自治县","530400"));
				map.put("530427",new Area("530427","新平彝族傣族自治县","530400"));
				map.put("530428",new Area("530428","元江哈尼族彝族傣族自治县","530400"));
			
			
			map.put("530500",new Area("530500","保山市","530000"));
				map.put("530502",new Area("530502","隆阳区","530500"));
				map.put("530521",new Area("530521","施甸县","530500"));
				map.put("530522",new Area("530522","腾冲县","530500"));
				map.put("530523",new Area("530523","龙陵县","530500"));
				map.put("530524",new Area("530524","昌宁县","530500"));
			
			
			map.put("530600",new Area("530600","昭通市","530000"));
				map.put("530602",new Area("530602","昭阳区","530600"));
				map.put("530621",new Area("530621","鲁甸县","530600"));
				map.put("530622",new Area("530622","巧家县","530600"));
				map.put("530623",new Area("530623","盐津县","530600"));
				map.put("530624",new Area("530624","大关县","530600"));
				map.put("530625",new Area("530625","永善县","530600"));
				map.put("530626",new Area("530626","绥江县","530600"));
				map.put("530627",new Area("530627","镇雄县","530600"));
				map.put("530628",new Area("530628","彝良县","530600"));
				map.put("530629",new Area("530629","威信县","530600"));
				map.put("530630",new Area("530630","水富县","530600"));
			
			
			map.put("530700",new Area("530700","丽江市","530000"));
				map.put("530702",new Area("530702","古城区","530700"));
				map.put("530721",new Area("530721","玉龙纳西族自治县","530700"));
				map.put("530722",new Area("530722","永胜县","530700"));
				map.put("530723",new Area("530723","华坪县","530700"));
				map.put("530724",new Area("530724","宁蒗彝族自治县","530700"));
			
				
			map.put("530800",new Area("530800","普洱市","530000"));
				map.put("530802",new Area("530802","思茅区","530800"));
				map.put("530821",new Area("530821","宁洱哈尼族彝族自治县","530800"));
				map.put("530822",new Area("530822","墨江哈尼族自治县","530800"));
				map.put("530823",new Area("530823","景东彝族自治县","530800"));
				map.put("530824",new Area("530824","景谷傣族彝族自治县","530800"));
				map.put("530825",new Area("530825","镇沅彝族哈尼族拉祜族自治县","530800"));
				map.put("530826",new Area("530826","江城哈尼族彝族自治县","530800"));
				map.put("530827",new Area("530827","孟连傣族拉祜族佤族自治县","530800"));
				map.put("530828",new Area("530828","澜沧拉祜族自治县","530800"));
				map.put("530829",new Area("530829","西盟佤族自治县","530800"));
			
			map.put("530900",new Area("530900","临沧市","530000"));
				map.put("530902",new Area("530902","临翔区","530900"));
				map.put("530921",new Area("530921","凤庆县","530900"));
				map.put("530922",new Area("530922","云县","530900"));
				map.put("530923",new Area("530923","永德县","530900"));
				map.put("530924",new Area("530924","镇康县","530900"));
				map.put("530925",new Area("530925","双江拉祜族佤族布朗族傣族自治县","530900"));
				map.put("530926",new Area("530926","耿马傣族佤族自治县","530900"));
				map.put("530927",new Area("530927","沧源佤族自治县","530900"));
			
			
			map.put("532300",new Area("532300","楚雄彝族自治州","530000"));
				map.put("532301",new Area("532301","楚雄市","532300"));
				map.put("532322",new Area("532322","双柏县","532300"));
				map.put("532323",new Area("532323","牟定县","532300"));
				map.put("532324",new Area("532324","南华县","532300"));
				map.put("532325",new Area("532325","姚安县","532300"));
				map.put("532326",new Area("532326","大姚县","532300"));
				map.put("532327",new Area("532327","永仁县","532300"));
				map.put("532328",new Area("532328","元谋县","532300"));
				map.put("532329",new Area("532329","武定县","532300"));
				map.put("532331",new Area("532331","禄丰县","532300"));
			
			
			map.put("532500",new Area("532500","红河哈尼族彝族自治州","530000"));
				map.put("532501",new Area("532501","个旧市","532500"));
				map.put("532502",new Area("532502","开远市","532500"));
				map.put("532522",new Area("532522","蒙自县","532500"));
				map.put("532523",new Area("532523","屏边苗族自治县","532500"));
				map.put("532524",new Area("532524","建水县","532500"));
				map.put("532525",new Area("532525","石屏县","532500"));
				map.put("532526",new Area("532526","弥勒县","532500"));
				map.put("532527",new Area("532527","泸西县","532500"));
				map.put("532528",new Area("532528","元阳县","532500"));
				map.put("532529",new Area("532529","红河县","532500"));
				map.put("532530",new Area("532530","金平苗族瑶族傣族自治县","532500"));
				map.put("532531",new Area("532531","绿春县","532500"));
				map.put("532532",new Area("532532","河口瑶族自治县","532500"));
				
			
			
			map.put("532600",new Area("532600","文山壮族苗族自治州","530000"));
				map.put("532621",new Area("532621","文山县","532600"));
				map.put("532622",new Area("532622","砚山县","532600"));
				map.put("532623",new Area("532623","西畴县","532600"));
				map.put("532624",new Area("532624","麻栗坡县","532600"));
				map.put("532625",new Area("532625","马关县","532600"));
				map.put("532626",new Area("532626","丘北县","532600"));
				map.put("532627",new Area("532627","广南县","532600"));
				map.put("532628",new Area("532628","富宁县","532600"));
			
			
			map.put("532800",new Area("532800","西双版纳傣族自治州","530000"));
				map.put("532801",new Area("532801","景洪市","532800"));
				map.put("532822",new Area("532822","勐海县","532800"));
				map.put("532823",new Area("532823","勐腊县","532800"));
			
			
			map.put("532900",new Area("532900","大理白族自治州","530000"));
				map.put("532901",new Area("532901","大理市","532900"));
				map.put("532922",new Area("532922","漾濞彝族自治县","532900"));
				map.put("532923",new Area("532923","祥云县","532900"));
				map.put("532924",new Area("532924","宾川县","532900"));
				map.put("532925",new Area("532925","弥渡县","532900"));
				map.put("532926",new Area("532926","南涧彝族自治县","532900"));
				map.put("532927",new Area("532927","巍山彝族回族自治县","532900"));
				map.put("532928",new Area("532928","永平县","532900"));
				map.put("532929",new Area("532929","云龙县","532900"));
				map.put("532930",new Area("532930","洱源县","532900"));
				map.put("532931",new Area("532931","剑川县","532900"));
				map.put("532932",new Area("532932","鹤庆县","532900"));
			
			
			map.put("533100",new Area("533100","德宏傣族景颇族自治州","530000"));
				map.put("533102",new Area("533102","瑞丽市","533100"));
				map.put("533103",new Area("533103","潞西市","533100"));
				map.put("533122",new Area("533122","梁河县","533100"));
				map.put("533123",new Area("533123","盈江县","533100"));
				map.put("533124",new Area("533124","陇川县","533100"));
			
			
			map.put("533300",new Area("533300","怒江傈僳族自治州","530000"));
				map.put("533321",new Area("533321","泸水县","533300"));
				map.put("533323",new Area("533323","福贡县","533300"));
				map.put("533324",new Area("533324","贡山独龙族怒族自治县","533300"));
				map.put("533325",new Area("533325","兰坪白族普米族自治县","533300"));
			
			
			map.put("533400",new Area("533400","迪庆藏族自治州","530000"));
				map.put("533421",new Area("533421","香格里拉县","533400"));
				map.put("533422",new Area("533422","德钦县","533400"));
				map.put("533423",new Area("533423","维西傈僳族自治县","533400"));
		
			
			
		/*
		 * 西藏自治区
		 */
		map.put("540000",new Area("540000","西藏自治区","0"));
			map.put("540100",new Area("540100","拉萨市","540000"));
				map.put("540102",new Area("540102","城关区","540100"));
				map.put("540121",new Area("540121","林周县","540100"));
				map.put("540122",new Area("540122","当雄县","540100"));
				map.put("540123",new Area("540123","尼木县","540100"));
				map.put("540124",new Area("540124","曲水县","540100"));
				map.put("540125",new Area("540125","堆龙德庆县","540100"));
				map.put("540126",new Area("540126","达孜县","540100"));
				map.put("540127",new Area("540127","墨竹工卡县","540100"));
			
			
			map.put("542100",new Area("542100","昌都地区","540000"));
				map.put("542121",new Area("542121","昌都县","542100"));
				map.put("542122",new Area("542122","江达县","542100"));
				map.put("542123",new Area("542123","贡觉县","542100"));
				map.put("542124",new Area("542124","类乌齐县","542100"));
				map.put("542125",new Area("542125","丁青县","542100"));
				map.put("542126",new Area("542126","察雅县","542100"));
				map.put("542127",new Area("542127","八宿县","542100"));
				map.put("542128",new Area("542128","左贡县","542100"));
				map.put("542129",new Area("542129","芒康县","542100"));
				map.put("542132",new Area("542132","洛隆县","542100"));
				map.put("542133",new Area("542133","边坝县","542100"));
			
			
			map.put("542200",new Area("542200","山南地区","540000"));
				map.put("542221",new Area("542221","乃东县","542200"));
				map.put("542222",new Area("542222","扎囊县","542200"));
				map.put("542223",new Area("542223","贡嘎县","542200"));
				map.put("542224",new Area("542224","桑日县","542200"));
				map.put("542225",new Area("542225","琼结县","542200"));
				map.put("542226",new Area("542226","曲松县","542200"));
				map.put("542227",new Area("542227","措美县","542200"));
				map.put("542228",new Area("542228","洛扎县","542200"));
				map.put("542229",new Area("542229","加查县","542200"));
				map.put("542231",new Area("542231","隆子县","542200"));
				map.put("542232",new Area("542232","错那县","542200"));
				map.put("542233",new Area("542233","浪卡子县","542200"));
			
			
			map.put("542300",new Area("542300","日喀则地区","540000"));
				map.put("542301",new Area("542301","日喀则市","542300"));
				map.put("542322",new Area("542322","南木林县","542300"));
				map.put("542323",new Area("542323","江孜县","542300"));
				map.put("542324",new Area("542324","定日县","542300"));
				map.put("542325",new Area("542325","萨迦县","542300"));
				map.put("542326",new Area("542326","拉孜县","542300"));
				map.put("542327",new Area("542327","昂仁县","542300"));
				map.put("542328",new Area("542328","谢通门县","542300"));
				map.put("542329",new Area("542329","白朗县","542300"));
				map.put("542330",new Area("542330","仁布县","542300"));
				map.put("542331",new Area("542331","康马县","542300"));
				map.put("542332",new Area("542332","定结县","542300"));
				map.put("542333",new Area("542333","仲巴县","542300"));
				map.put("542334",new Area("542334","亚东县","542300"));
				map.put("542335",new Area("542335","吉隆县","542300"));
				map.put("542336",new Area("542336","聂拉木县","542300"));
				map.put("542337",new Area("542337","萨嘎县","542300"));
				map.put("542338",new Area("542338","岗巴县","542300"));
			
			
			map.put("542400",new Area("542400","那曲地区","540000"));
				map.put("542421",new Area("542421","那曲县","542400"));
				map.put("542422",new Area("542422","嘉黎县","542400"));
				map.put("542423",new Area("542423","比如县","542400"));
				map.put("542424",new Area("542424","聂荣县","542400"));
				map.put("542425",new Area("542425","安多县","542400"));
				map.put("542426",new Area("542426","申扎县","542400"));
				map.put("542427",new Area("542427","索县","542400"));
				map.put("542428",new Area("542428","班戈县","542400"));
				map.put("542429",new Area("542429","巴青县","542400"));
				map.put("542430",new Area("542430","尼玛县","542400"));
			
			
			map.put("542500",new Area("542500","阿里地区","540000"));
				map.put("542521",new Area("542521","普兰县","542500"));
				map.put("542522",new Area("542522","札达县","542500"));
				map.put("542523",new Area("542523","噶尔县","542500"));
				map.put("542524",new Area("542524","日土县","542500"));
				map.put("542525",new Area("542525","革吉县","542500"));
				map.put("542526",new Area("542526","改则县","542500"));
				map.put("542527",new Area("542527","措勤县","542500"));
			
			
			map.put("542600",new Area("542600","林芝地区","540000"));
				map.put("542621",new Area("542621","林芝县","542600"));
				map.put("542622",new Area("542622","工布江达县","542600"));
				map.put("542623",new Area("542623","米林县","542600"));
				map.put("542624",new Area("542624","墨脱县","542600"));
				map.put("542625",new Area("542625","波密县","542600"));
				map.put("542626",new Area("542626","察隅县","542600"));
				map.put("542627",new Area("542627","朗县","542600"));
		
		/*
		 * 陕西省
		 */
		map.put("610000",new Area("610000","陕西省","0"));
			map.put("610100",new Area("610100","西安市","610000"));
				map.put("610102",new Area("610102","新城区","610100"));
				map.put("610103",new Area("610103","碑林区","610100"));
				map.put("610104",new Area("610104","莲湖区","610100"));
				map.put("610111",new Area("610111","灞桥区","610100"));
				map.put("610112",new Area("610112","未央区","610100"));
				map.put("610113",new Area("610113","雁塔区","610100"));
				map.put("610114",new Area("610114","阎良区","610100"));
				map.put("610115",new Area("610115","临潼区","610100"));
				map.put("610116",new Area("610116","长安区","610100"));
				map.put("610122",new Area("610122","蓝田县","610100"));
				map.put("610124",new Area("610124","周至县","610100"));
				map.put("610125",new Area("610125","户县","610100"));
				map.put("610126",new Area("610126","高陵县","610100"));
			
			
			map.put("610200",new Area("610200","铜川市","610000"));
				map.put("610202",new Area("610202","王益区","610200"));
				map.put("610203",new Area("610203","印台区","610200"));
				map.put("610204",new Area("610204","耀州区","610200"));
				map.put("610222",new Area("610222","宜君县","610200"));
			
			
			map.put("610300",new Area("610300","宝鸡市","610000"));
				map.put("610302",new Area("610302","渭滨区","610300"));
				map.put("610303",new Area("610303","金台区","610300"));
				map.put("610304",new Area("610304","陈仓区","610300"));
				map.put("610322",new Area("610322","凤翔县","610300"));
				map.put("610323",new Area("610323","岐山县","610300"));
				map.put("610324",new Area("610324","扶风县","610300"));
				map.put("610326",new Area("610326","眉县","610300"));
				map.put("610327",new Area("610327","陇县","610300"));
				map.put("610328",new Area("610328","千阳县","610300"));
				map.put("610329",new Area("610329","麟游县","610300"));
				map.put("610330",new Area("610330","凤县","610300"));
				map.put("610331",new Area("610331","太白县","610300"));
			
			
			map.put("610400",new Area("610400","咸阳市","610000"));
				map.put("610402",new Area("610402","秦都区","610400"));
				map.put("610403",new Area("610403","杨陵区","610400"));
				map.put("610404",new Area("610404","渭城区","610400"));
				map.put("610422",new Area("610422","三原县","610400"));
				map.put("610423",new Area("610423","泾阳县","610400"));
				map.put("610424",new Area("610424","乾县","610400"));
				map.put("610425",new Area("610425","礼泉县","610400"));
				map.put("610426",new Area("610426","永寿县","610400"));
				map.put("610427",new Area("610427","彬县","610400"));
				map.put("610428",new Area("610428","长武县","610400"));
				map.put("610429",new Area("610429","旬邑县","610400"));
				map.put("610430",new Area("610430","淳化县","610400"));
				map.put("610431",new Area("610431","武功县","610400"));
				map.put("610481",new Area("610481","兴平市","610400"));
			
			
			map.put("610500",new Area("610500","渭南市","610000"));
				map.put("610502",new Area("610502","临渭区","610500"));
				map.put("610521",new Area("610521","华县","610500"));
				map.put("610522",new Area("610522","潼关县","610500"));
				map.put("610523",new Area("610523","大荔县","610500"));
				map.put("610524",new Area("610524","合阳县","610500"));
				map.put("610525",new Area("610525","澄城县","610500"));
				map.put("610526",new Area("610526","蒲城县","610500"));
				map.put("610527",new Area("610527","白水县","610500"));
				map.put("610528",new Area("610528","富平县","610500"));
				map.put("610581",new Area("610581","韩城市","610500"));
				map.put("610582",new Area("610582","华阴市","610500"));
			
			
			map.put("610600",new Area("610600","延安市","610000"));
				map.put("610602",new Area("610602","宝塔区","610600"));
				map.put("610621",new Area("610621","延长县","610600"));
				map.put("610622",new Area("610622","延川县","610600"));
				map.put("610623",new Area("610623","子长县","610600"));
				map.put("610624",new Area("610624","安塞县","610600"));
				map.put("610625",new Area("610625","志丹县","610600"));
				map.put("610626",new Area("610626","吴起县","610600"));
				map.put("610627",new Area("610627","甘泉县","610600"));
				map.put("610628",new Area("610628","富县","610600"));
				map.put("610629",new Area("610629","洛川县","610600"));
				map.put("610630",new Area("610630","宜川县","610600"));
				map.put("610631",new Area("610631","黄龙县","610600"));
				map.put("610632",new Area("610632","黄陵县","610600"));
			
			
			map.put("610700",new Area("610700","汉中市","610000"));
				map.put("610702",new Area("610702","汉台区","610700"));
				map.put("610721",new Area("610721","南郑县","610700"));
				map.put("610722",new Area("610722","城固县","610700"));
				map.put("610723",new Area("610723","洋县","610700"));
				map.put("610724",new Area("610724","西乡县","610700"));
				map.put("610725",new Area("610725","勉县","610700"));
				map.put("610726",new Area("610726","宁强县","610700"));
				map.put("610727",new Area("610727","略阳县","610700"));
				map.put("610728",new Area("610728","镇巴县","610700"));
				map.put("610729",new Area("610729","留坝县","610700"));
				map.put("610730",new Area("610730","佛坪县","610700"));
			
			
			map.put("610800",new Area("610800","榆林市","610000"));
				map.put("610802",new Area("610802","榆阳区","610800"));
				map.put("610821",new Area("610821","神木县","610800"));
				map.put("610822",new Area("610822","府谷县","610800"));
				map.put("610823",new Area("610823","横山县","610800"));
				map.put("610824",new Area("610824","靖边县","610800"));
				map.put("610825",new Area("610825","定边县","610800"));
				map.put("610826",new Area("610826","绥德县","610800"));
				map.put("610827",new Area("610827","米脂县","610800"));
				map.put("610828",new Area("610828","佳县","610800"));
				map.put("610829",new Area("610829","吴堡县","610800"));
				map.put("610830",new Area("610831","清涧县","610800"));
				map.put("610831",new Area("610832","子洲县","610800"));
			
			
			map.put("610900",new Area("610900","安康市","610000"));
				map.put("610902",new Area("610902","汉滨区","610900"));
				map.put("610921",new Area("610921","汉阴县","610900"));
				map.put("610922",new Area("610922","石泉县","610900"));
				map.put("610923",new Area("610923","宁陕县","610900"));
				map.put("610924",new Area("610924","紫阳县","610900"));
				map.put("610925",new Area("610925","岚皋县","610900"));
				map.put("610926",new Area("610926","平利县","610900"));
				map.put("610927",new Area("610927","镇坪县","610900"));
				map.put("610928",new Area("610928","旬阳县","610900"));
				map.put("610929",new Area("610929","白河县","610900"));
			
			
			map.put("611000",new Area("611000","商洛市","610000"));
				map.put("611002",new Area("611002","商州区","611000"));
				map.put("611021",new Area("611021","洛南县","611000"));
				map.put("611022",new Area("611022","丹凤县","611000"));
				map.put("611023",new Area("611023","商南县","611000"));
				map.put("611024",new Area("611024","山阳县","611000"));
				map.put("611025",new Area("611025","镇安县","611000"));
				map.put("611026",new Area("611026","柞水县","611000"));
			
			
		/*
		 * 甘肃省
		 */
		map.put("620000",new Area("620000","甘肃省","0"));
			map.put("620100",new Area("620100","兰州市","620000"));
				map.put("620102",new Area("620102","城关区","620100"));
				map.put("620103",new Area("620103","七里河区","620100"));
				map.put("620104",new Area("620104","西固区","620100"));
				map.put("620105",new Area("620105","安宁区","620100"));
				map.put("620111",new Area("620111","红古区","620100"));
				map.put("620121",new Area("620121","永登县","620100"));
				map.put("620122",new Area("620122","皋兰县","620100"));
				map.put("620123",new Area("620123","榆中县","620100"));
			
			
			map.put("620200",new Area("620200","嘉峪关市","620000"));
			
			
			map.put("620300",new Area("620300","金昌市","620000"));
				map.put("620302",new Area("620302","金川区","620300"));
				map.put("620321",new Area("620321","永昌县","620300"));
			
			
			map.put("620400",new Area("620400","白银市","620000"));
				map.put("620402",new Area("620402","白银区","620400"));
				map.put("620403",new Area("620403","平川区","620400"));
				map.put("620421",new Area("620421","靖远县","620400"));
				map.put("620422",new Area("620422","会宁县","620400"));
				map.put("620423",new Area("620423","景泰县","620400"));
			
			
			map.put("620500",new Area("620500","天水市","620000"));
				map.put("620502",new Area("620502","秦州区","620500"));
				map.put("620503",new Area("620503","麦积区","620500"));
				map.put("620521",new Area("620521","清水县","620500"));
				map.put("620522",new Area("620522","秦安县","620500"));
				map.put("620523",new Area("620523","甘谷县","620500"));
				map.put("620524",new Area("620524","武山县","620500"));
				map.put("620525",new Area("620525","张家川回族自治县","620500"));
			
			
			map.put("620600",new Area("620600","武威市","620000"));
				map.put("620602",new Area("620602","凉州区","620600"));
				map.put("620621",new Area("620621","民勤县","620600"));
				map.put("620622",new Area("620622","古浪县","620600"));
				map.put("620623",new Area("620623","天祝藏族自治县","620600"));
			
			
			map.put("620700",new Area("620700","张掖市","620000"));
				map.put("620702",new Area("620702","甘州区","620700"));
				map.put("620721",new Area("620721","肃南裕固族自治县","620700"));
				map.put("620722",new Area("620722","民乐县","620700"));
				map.put("620723",new Area("620723","临泽县","620700"));
				map.put("620724",new Area("620724","高台县","620700"));
				map.put("620725",new Area("620725","山丹县","620700"));
			
			
			map.put("620800",new Area("620800","平凉市","620000"));
				map.put("620802",new Area("620802","崆峒区","620800"));
				map.put("620821",new Area("620821","泾川县","620800"));
				map.put("620822",new Area("620822","灵台县","620800"));
				map.put("620823",new Area("620823","崇信县","620800"));
				map.put("620824",new Area("620824","华亭县","620800"));
				map.put("620825",new Area("620825","庄浪县","620800"));
				map.put("620826",new Area("620826","静宁县","620800"));
			
			
			map.put("620900",new Area("620900","酒泉市","620000"));
				map.put("620902",new Area("620902","肃州区","620900"));
				map.put("620921",new Area("620921","金塔县","620900"));
				map.put("620922",new Area("620922","安西县","620900"));
				map.put("620923",new Area("620923","肃北蒙古族自治县","620900"));
				map.put("620924",new Area("620924","阿克塞哈萨克族自治县","620900"));
				map.put("620981",new Area("620981","玉门市","620900"));
				map.put("620982",new Area("620982","敦煌市","620900"));
			
			
			map.put("621000",new Area("621000","庆阳市","620000"));
				map.put("621002",new Area("621002","西峰区","621000"));
				map.put("621021",new Area("621021","庆城县","621000"));
				map.put("621022",new Area("621022","环县","621000"));
				map.put("621023",new Area("621023","华池县","621000"));
				map.put("621024",new Area("621024","合水县","621000"));
				map.put("621025",new Area("621025","正宁县","621000"));
				map.put("621026",new Area("621026","宁县","621000"));
				map.put("621027",new Area("621027","镇原县","621000"));
			
			
			map.put("621100",new Area("621100","定西市","620000"));
				map.put("621102",new Area("621102","安定区","621100"));
				map.put("621121",new Area("621121","通渭县","621100"));
				map.put("621122",new Area("621122","陇西县","621100"));
				map.put("621123",new Area("621123","渭源县","621100"));
				map.put("621124",new Area("621124","临洮县","621100"));
				map.put("621125",new Area("621125","漳县","621100"));
				map.put("621126",new Area("621126","岷县","621100"));
			
			map.put("621200",new Area("621200","陇南市","620000"));
				map.put("621202",new Area("621202","武都区","621200"));
				map.put("621221",new Area("621221","成县","621200"));
				map.put("621222",new Area("621222","文县","621200"));
				map.put("621223",new Area("621223","宕昌县","621200"));
				map.put("621224",new Area("621224","康县","621200"));
				map.put("621225",new Area("621225","西和县","621200"));
				map.put("621226",new Area("621226","礼县","621200"));
				map.put("621227",new Area("621227","徽县","621200"));
				map.put("621228",new Area("621228","两当县","621200"));
			
			map.put("622900",new Area("622900","临夏回族自治州","620000"));
				map.put("622901",new Area("622901","临夏市","622900"));
				map.put("622921",new Area("622921","临夏县","622900"));
				map.put("622922",new Area("622922","康乐县","622900"));
				map.put("622923",new Area("622923","永靖县","622900"));
				map.put("622924",new Area("622924","广河县","622900"));
				map.put("622925",new Area("622925","和政县","622900"));
				map.put("622926",new Area("622926","东乡族自治县","622900"));
				map.put("622927",new Area("622927","积石山保安族东乡族撒拉族自治县","622900"));
			
			
			map.put("623000",new Area("623000","甘南藏族自治州","620000"));
				map.put("623001",new Area("623001","合作市","623000"));
				map.put("623021",new Area("623021","临潭县","623000"));
				map.put("623022",new Area("623022","卓尼县","623000"));
				map.put("623023",new Area("623023","舟曲县","623000"));
				map.put("623024",new Area("623024","迭部县","623000"));
				map.put("623025",new Area("623025","玛曲县","623000"));
				map.put("623026",new Area("623026","碌曲县","623000"));
				map.put("623027",new Area("623027","夏河县","623000"));
			
		/*
		 * 青海省
		 */
		map.put("630000",new Area("630000","青海省","0"));
			map.put("630100",new Area("630100","西宁市","630000"));
				map.put("630102",new Area("630102","城东区","630100"));
				map.put("630103",new Area("630103","城中区","630100"));
				map.put("630104",new Area("630104","城西区","630100"));
				map.put("630105",new Area("630105","城北区","630100"));
				map.put("630121",new Area("630121","大通回族土族自治县","630100"));
				map.put("630122",new Area("630122","湟中县","630100"));
				map.put("630123",new Area("630123","湟源县","630100"));
				
			
			map.put("632100",new Area("632100","海东地区","630000"));
				map.put("632121",new Area("632121","平安县","632100"));
				map.put("632122",new Area("632122","民和回族土族自治县","632100"));
				map.put("632123",new Area("632123","乐都县","632100"));
				map.put("632126",new Area("632126","互助土族自治县","632100"));
				map.put("632127",new Area("632127","化隆回族自治县","632100"));
				map.put("632128",new Area("632128","循化撒拉族自治县","632100"));
			
			map.put("632200",new Area("632200","海北藏族自治州","630000"));
				map.put("632221",new Area("632221","门源回族自治县","632200"));
				map.put("632222",new Area("632222","祁连县","632200"));
				map.put("632223",new Area("632223","海晏县","632200"));
				map.put("632224",new Area("632224","刚察县","632200"));
			
			map.put("632300",new Area("632300","黄南藏族自治州","630000"));
				map.put("632321",new Area("632321","同仁县","632300"));
				map.put("632322",new Area("632322","尖扎县","632300"));
				map.put("632323",new Area("632323","泽库县","632300"));
				map.put("632324",new Area("632324","河南蒙古族自治县","632300"));
			
			map.put("632500",new Area("632500","海南藏族自治州","630000"));
				map.put("632521",new Area("632521","共和县","632500"));
				map.put("632522",new Area("632522","同德县","632500"));
				map.put("632523",new Area("632523","贵德县","632500"));
				map.put("632524",new Area("632524","兴海县","632500"));
				map.put("632525",new Area("632525","贵南县","632500"));
			
			map.put("632600",new Area("632600","果洛藏族自治州","630000"));
				map.put("632621",new Area("632621","玛沁县","632600"));
				map.put("632622",new Area("632622","班玛县","632600"));
				map.put("632623",new Area("632623","甘德县","632600"));
				map.put("632624",new Area("632624","达日县","632600"));
				map.put("632625",new Area("632625","久治县","632600"));
				map.put("632626",new Area("632626","玛多县","632600"));
			
			map.put("632700",new Area("632700","玉树藏族自治州","630000"));
				map.put("632721",new Area("632721","玉树县","632700"));
				map.put("632722",new Area("632722","杂多县","632700"));
				map.put("632723",new Area("632723","称多县","632700"));
				map.put("632724",new Area("632724","治多县","632700"));
				map.put("632725",new Area("632725","囊谦县","632700"));
				map.put("632726",new Area("632726","曲麻莱县","632700"));
			
			map.put("632800",new Area("632800","海西蒙古族藏族自治州","630000"));
				map.put("632801",new Area("632801","格尔木市","632800"));
				map.put("632802",new Area("632802","德令哈市","632800"));
				map.put("632821",new Area("632821","乌兰县","632800"));
				map.put("632822",new Area("632822","都兰县","632800"));
				map.put("632823",new Area("632823","天峻县","632800"));
	}
	
}
